bolknote/MK61S_MINI/code/terminal.cpp
#include "terminal.hpp"
#include "Arduino.h"
#include "bounded_string.hpp"
#include "config.h"
#include "device_identity.hpp"
#include "hardware_info.hpp"
#include "rust_types.h"
#include "cross_hal.h"
#include "crc32.hpp"
#include "mk61emu_core.h"
#include "disasm.hpp"
#include "tools.hpp"
#include "calculator_control.hpp"
#include "lcd_ru.hpp"
#include "ledcontrol.h"
#include "mk_math.hpp"
#include "mk61_ref.hpp"
#include "mk61_register_init.hpp"
#include "entropy_pool.hpp"
#include "m61_print.hpp"
#include "m61_ansi.hpp"
#include "m61_text.hpp"
#include "virtual_fat.hpp"
#include "program_store.hpp"
#include "language_workspace.hpp"
#if MK61_ANY_LOADABLE_MODULE
  #include "loadable_module_runtime.hpp"
#endif
#include "shared_scratch.hpp"
#include "shared_memory.hpp"
#include "workspace_swap.hpp"
#include "storage_path.hpp"
#include "spi_nor_flash.hpp"
#if MK61_ENABLE_READ_BENCHMARKS
  #include "read_benchmark.hpp"
#endif
#include "resident_firmware.hpp"
#include "power_monitor.hpp"
#if defined(MK61_OLED1602_WS0010)
  #include "ws0010_charset.hpp"
  #include "ws0010_graphics.hpp"
#endif
#include "terminal_command_ids.hpp"
#include "terminal_core.hpp"
#include "terminal_file_transfer.hpp"
#include "terminal_front_coding.hpp"
#include "terminal_line_editor.hpp"
#include "terminal_output.hpp"
#if MK61_ENABLE_TERMINAL_ENCODING
  #include "terminal_encoding.hpp"
#endif
#include "terminal_protocol.hpp"
#include "usb_screen.hpp"
#include "utf8_view.hpp"
#include "rtc_clock.hpp"
#include "dwt_profiler.hpp"
#include "classic_timer.hpp"
#include "crash_dump.hpp"
#include "independent_watchdog.hpp"
#include "mpu_guard.hpp"
#include "idle_sleep.hpp"
#include "deep_idle.hpp"
#include "usb_cdc_rx_guard.hpp"
#include "usb_power.hpp"
#if MK61_ENABLE_SPI1_ARBITER
  #include "spi1_bus.hpp"
#endif
#if MK61_ENABLE_SPI1_DMA
  #include "spi1_dma.hpp"
#endif



extern  const char terminal_symbols[16];
extern  const char display_symbols[16];


#include "terminal_key_sequence.hpp"


const   u8                  CR = 0x0D;
const   u8                  NL = 0x0A;

extern  class_disassm_mk61  disassembler;
extern  void DFU_enable(void);
extern  void idle_signal_reset(void);



#include "terminal_catalog.hpp"
static const char* terminal_skip_spaces(const char* p) {
  while(p != NULL && (*p == ' ' || *p == '\t')) p++;
  return p;
}

static bool terminal_arg_end(const char* p) {
  p = terminal_skip_spaces(p);
  return p == NULL || *p == 0 || *p == '\r' || *p == '\n';
}

static bool terminal_parse_quick_number(const char* args, usize& number_out) {
  args = terminal_skip_spaces(args);
  if(args == NULL || *args < '0' || *args > '9') return false;

  usize number = 0;
  const char* p = args;
  while(*p >= '0' && *p <= '9') {
    number = number * 10 + (usize) (*p - '0');
    if(number > MAX_SLOT_FOR_PROGRAM) return false;
    p++;
  }
  if(!terminal_arg_end(p)) return false;
  number_out = number;
  return true;
}

static bool terminal_copy_arg(char* out, usize capacity, const char* args) {
  args = terminal_skip_spaces(args);
  if(out == NULL || capacity == 0 || args == NULL) return false;
  usize len = 0;
  while(args[len] != 0 && args[len] != '\r' && args[len] != '\n') len++;
  while(len > 0 && (args[len - 1] == ' ' || args[len - 1] == '\t')) len--;
  if(len == 0 || len >= capacity) return false;
  memcpy(out, args, len);
  out[len] = 0;
  return true;
}

static bool terminal_single_token(const char* args, char* out,
                                  usize capacity) {
  const char* cursor = args;
  return terminal_core::parse_token(cursor, out, capacity) &&
         terminal_core::at_end(cursor);
}

#if MK61_ENABLE_TERMINAL_ENCODING
// One physical CDC stream is shared by the interactive terminal and M61
// scripts, therefore encoding is a connection property rather than duplicated
// state in both class_terminal instances.  Human terminals start in CP1251;
// machine clients explicitly request UTF-8 when they connect.
static terminal_encoding::Mode terminal_text_encoding =
    terminal_encoding::Mode::CP1251;

static bool terminal_serial_write_byte(u8 byte, void*) {
  return Serial.write(byte) == 1;
}

static void terminal_write_cp1251(const char* text) {
  (void) terminal_encoding::write_cp1251(
      text, terminal_text_encoding, terminal_serial_write_byte, nullptr);
}

static void terminal_write_utf8(const char* text) {
  (void) terminal_encoding::write_utf8(
      text, terminal_text_encoding, terminal_serial_write_byte, nullptr);
}

static void terminal_write_utf8(const u8* text, usize length) {
  (void) terminal_encoding::write_utf8(
      text, length, terminal_text_encoding, terminal_serial_write_byte,
      nullptr);
}

static void terminal_println_cp1251(const char* text) {
  terminal_write_cp1251(text);
  Serial.println();
}

static void terminal_println_utf8(const char* text) {
  terminal_write_utf8(text);
  Serial.println();
}

static terminal_protocol::Result terminal_exec_encoding(const char* args) {
  terminal_encoding::Mode requested = terminal_text_encoding;
  const terminal_encoding::ParseResult parsed =
      terminal_encoding::parse(args, requested);
  if(parsed == terminal_encoding::ParseResult::INVALID) {
    Serial.println("Usage: encoding <utf-8|cp1251>");
    return terminal_protocol::Result::error();
  }
  if(parsed == terminal_encoding::ParseResult::SET) {
    terminal_text_encoding = requested;
  }
  // The acknowledgement is deliberately ASCII-only: it remains readable
  // while a host switches its decoder in either direction.
  Serial.print("encoding ");
  Serial.println(terminal_encoding::name(terminal_text_encoding));
  return terminal_protocol::Result::ok();
}
#else
// An explicitly reduced build may keep the historic wire representation:
// mnemonics/registers are CP1251 and filesystem text is UTF-8. These wrappers
// keep all call sites identical without pulling a transcoder into Flash.
static void terminal_write_cp1251(const char* text) { Serial.print(text); }
static void terminal_write_utf8(const char* text) { Serial.print(text); }
static void terminal_write_utf8(const u8* text, usize length) {
  Serial.write(text, length);
}
static void terminal_println_cp1251(const char* text) {
  Serial.println(text);
}
static void terminal_println_utf8(const char* text) {
  Serial.println(text);
}
#endif

static void terminal_path_error(const char* operation,
                                storage_path::Status status) {
  Serial.print(operation);
  Serial.print(": ");
  Serial.println(storage_path::status_text(status));
}

