bolknote/MK61S_MINI/code/terminal.cpp
void class_terminal::print_prompt(void) {
      char path[64];
      if(storage_path::format_directory(current_directory, path,
                                        sizeof(path)) ==
         storage_path::Status::OK) terminal_write_utf8(path);
      else Serial.print("...");
      Serial.print("> ");
    }

void class_terminal::move_terminal_cursor(char direction, usize columns) {
      if(columns == 0) return;
      Serial.write(0x1B);
      Serial.write('[');
      Serial.print(columns);
      Serial.write(direction);
    }

usize class_terminal::input_columns(usize begin, usize end) const {
      if(begin >= end || end > recive_pos) return 0;
      return utf8_view::codepoint_count(
          (const char*) input_buffer + begin, (u16) (end - begin));
    }

void class_terminal::redraw_input_line(void) {
      Serial.write('\r');
      print_prompt();
      terminal_write_utf8(input_buffer, recive_pos);
      Serial.print("\x1B[K");
      move_terminal_cursor('D', input_columns(input_cursor, recive_pos));
    }

void class_terminal::history_recall(i8 nav) {
      if(nav < 0) {  // выход из истории: вернуть редактируемую строку
        memcpy(input_buffer, saved_line, saved_len);
        recive_pos = saved_len;
        input_cursor = saved_cursor;
      } else {
        const u8 slot = (u8) ((hist_head + hist_count - 1 - nav) % HISTORY_DEPTH);
        history_entry_read(slot, input_buffer);
        recive_pos = hist_length[slot];
        input_cursor = recive_pos;
      }
      input_buffer[recive_pos] = 0;
      hist_nav = nav;
      redraw_input_line();
    }

void class_terminal::history_key_up(void) {
      if(hist_nav + 1 >= (i8) hist_count) return;
      if(hist_nav < 0) {  // запомнить строку, набранную до входа в историю
        memcpy(saved_line, input_buffer, recive_pos);
        saved_len = recive_pos;
        saved_cursor = input_cursor;
      }
      history_recall((i8) (hist_nav + 1));
    }

void class_terminal::history_key_down(void) {
      if(hist_nav < 0) return;
      history_recall((i8) (hist_nav - 1));
    }

void class_terminal::editor_move_left(void) {
      if(terminal_line_editor::move_left(input_buffer, recive_pos,
                                         input_cursor)) {
        move_terminal_cursor('D', 1);
      }
    }

void class_terminal::editor_move_right(void) {
      if(terminal_line_editor::move_right(input_buffer, recive_pos,
                                          input_cursor)) {
        move_terminal_cursor('C', 1);
      }
    }

void class_terminal::editor_move_home(void) {
      const usize columns = input_columns(0, input_cursor);
      input_cursor = 0;
      move_terminal_cursor('D', columns);
    }

void class_terminal::editor_move_end(void) {
      const usize columns = input_columns(input_cursor, recive_pos);
      input_cursor = recive_pos;
      move_terminal_cursor('C', columns);
    }

void class_terminal::editor_backspace(void) {
      if(terminal_line_editor::backspace(input_buffer, recive_pos,
                                         input_cursor, MAX_INPUT_CHAR)) {
        redraw_input_line();
      }
    }

void class_terminal::editor_delete_forward(void) {
      if(terminal_line_editor::delete_forward(input_buffer, recive_pos,
                                              input_cursor,
                                              MAX_INPUT_CHAR)) {
        redraw_input_line();
      }
    }

bool class_terminal::editor_insert(u8 byte) {
      const bool at_end = input_cursor == recive_pos;
      if(!terminal_line_editor::insert_byte(input_buffer, recive_pos,
                                            input_cursor, MAX_INPUT_CHAR,
                                            byte)) return false;
      if(at_end) Serial.write(byte);
      else redraw_input_line();
      return true;
    }

void class_terminal::editor_key(terminal_line_editor::Key key) {
      switch(key) {
        case terminal_line_editor::Key::UP:             history_key_up(); break;
        case terminal_line_editor::Key::DOWN:           history_key_down(); break;
        case terminal_line_editor::Key::RIGHT:          editor_move_right(); break;
        case terminal_line_editor::Key::LEFT:           editor_move_left(); break;
        case terminal_line_editor::Key::HOME:           editor_move_home(); break;
        case terminal_line_editor::Key::END:            editor_move_end(); break;
        case terminal_line_editor::Key::DELETE_FORWARD: editor_delete_forward(); break;
        case terminal_line_editor::Key::NONE:            break;
      }
    }

void class_terminal::print_help(void) {
#if MK61_SETUP_IS_LOADABLE
      program_store::Entry pages[2] = {};
      bool available = true;
      char path[] = "/System/HELP0.TXT";
      for(u8 page = 0; page < 2; ++page) {
        path[12] = (char) ('0' + page);
        u8 tag[9]; u16 count = 0;
        available = available && storage_path::resolve_file(program_store::ROOT_ID,
            path, program_store::ProgramType::TEXT, pages[page]) == storage_path::Status::OK &&
            program_store::read_range_id(pages[page].id, 0, tag, sizeof(tag), &count) &&
            count == sizeof(tag) && memcmp(tag, terminal_catalog::help_signature(), sizeof(tag)) == 0;
      }
      Serial.println("Available commands:");
      if(available) {
        u8 buffer[64];
        for(const auto& page : pages) {
          for(u16 offset = 9; offset < page.data_len;) {
            const u16 wanted = (u16) (((usize) (page.data_len - offset) < sizeof(buffer))
                ? page.data_len - offset : sizeof(buffer));
            u16 count = 0;
            if(!program_store::read_range_id(page.id, offset, buffer, wanted, &count) || count != wanted) {
              Serial.println("HELP read error"); return;
            }
            Serial.write(buffer, count); offset += count;
          }
        }
        return;
      }
      for(usize i = 0; i < terminal_catalog::count(); ++i) {
        Serial.print(terminal_catalog::at(i).name); Serial.write(' ');
      }
      Serial.println("\nInstall matching /System/HELP0.TXT and HELP1.TXT");
      Serial.println("fsls /System; fsput begin /System/<file> <size> <crc32>; fsput data <offset> <hex>; fsput end");
#else

      Serial.println("Available commands:");
      for(usize i = 0; i < terminal_catalog::count(); i++) {
        const auto command = terminal_catalog::at(i);
        if(command.desc == NULL) continue;
        Serial.print("  ");
        Serial.print(command.name);
        for(usize pad = strlen(command.name); pad < 8; pad++) Serial.write(' ');
        Serial.println(command.desc);
      }
      Serial.println("  R<r>=   R<r>= <number|random|raw 12hex> - write register");
      Serial.println("  set$    set$<addr> <hex> - write program memory");
#endif
    }

#if MK61_CRASH_DUMP_SUPPORTED
void class_terminal::print_crash_usage(void) {
      #if MK61_ENABLE_FAULT_INJECTION
      Serial.println(
          "Usage: crash [show|clear|save [path.txt]|test <usage|bus|hard>]");
      #else
      Serial.println("Usage: crash [show|clear|save [path.txt]]");
      #endif

