bolknote/MK61S_MINI/code/terminal.cpp
      #if MK61_ENABLE_MPU_TEST
      if(strcmp(action, "test") == 0) {
        char fault[12];
        if(!terminal_core::parse_token(cursor, fault, sizeof(fault)) ||
           !terminal_core::at_end(cursor)) {
          print_mpu_usage();
          return terminal_protocol::Result::error();
        }
        terminal_output::line(Serial, "MPU injecting ", fault);
        Serial.flush();
        delay(20);
        bool injected = false;
        if(strcmp(fault, "guard") == 0) {
          injected = mpu_guard::inject_guard_fault();
        } else if(strcmp(fault, "null") == 0) {
          injected = mpu_guard::inject_null_fault();
        } else if(strcmp(fault, "exec") == 0) {
          injected = mpu_guard::inject_execute_fault();
        } else {
          print_mpu_usage();
          return terminal_protocol::Result::error();
        }
        (void) injected;
        Serial.println("MPU fault was not raised");
        return terminal_protocol::Result::error();
      }
      #endif

      print_mpu_usage();
      return terminal_protocol::Result::error();
    }

#endif
#if MK61_INDEPENDENT_WATCHDOG_SUPPORTED
const char* class_terminal::watchdog_state_name(u32 state) {
      switch(state) {
        case independent_watchdog::RETAINED_RUNNING: return "running";
        case independent_watchdog::RETAINED_INHIBITED: return "inhibited";
        case independent_watchdog::RETAINED_HANG_TEST: return "hang-test";
        default: return "unknown";
      }
    }

void class_terminal::print_watchdog_usage(void) {
      #if MK61_ENABLE_WATCHDOG_TEST
      Serial.println("Usage: wdog [status|test <starve|hang>]");
      #else
      Serial.println("Usage: wdog [status]");
      #endif
    }

terminal_protocol::Result class_terminal::show_watchdog_status(void) {
      const independent_watchdog::Snapshot snapshot =
          independent_watchdog::statistics();
      terminal_output::field(
          Serial, "WDOG backend=IWDG running=", independent_watchdog::running() ? 1 : 0);
      terminal_output::field(
          Serial, " nominal_ms=", independent_watchdog::NOMINAL_TIMEOUT_MS);
      terminal_output::field(Serial, " reset=", snapshot.boot_was_watchdog_reset ? 1 : 0);
      terminal_output::field(Serial, " generation=", snapshot.generation);
      terminal_output::field(Serial, " epochs=", snapshot.gate.epochs);
      terminal_output::field(Serial, " reloads=", snapshot.gate.reloads);
      terminal_output::field(Serial, " last_epoch_ms=", snapshot.gate.last_epoch_ms);
      terminal_output::field(Serial, " last_reload_ms=", snapshot.gate.last_reload_ms);
      terminal_output::line(Serial, " max_gap_ms=", snapshot.gate.maximum_reload_gap_ms);

      if(snapshot.previous_breadcrumb_valid) {
        terminal_output::field(
            Serial, "WDOG previous generation=", snapshot.previous.generation);
        terminal_output::field(
            Serial, " state=", watchdog_state_name(snapshot.previous.state));
        terminal_output::field(Serial, " epochs=", snapshot.previous.epochs);
        terminal_output::field(Serial, " reloads=", snapshot.previous.reloads);
        terminal_output::field(Serial, " last_epoch_ms=", snapshot.previous.last_epoch_ms);
        terminal_output::field(Serial, " last_reload_ms=", snapshot.previous.last_reload_ms);
        terminal_output::line(
            Serial, " max_gap_ms=", snapshot.previous.maximum_reload_gap_ms);
      }
      return terminal_protocol::Result::ok();
    }

terminal_protocol::Result class_terminal::exec_watchdog(void) {
      const char* cursor = command_args();
      if(terminal_core::at_end(cursor)) return show_watchdog_status();

      char action[12];
      if(!terminal_core::parse_token(cursor, action, sizeof(action))) {
        print_watchdog_usage();
        return terminal_protocol::Result::error();
      }
      if(strcmp(action, "status") == 0 && terminal_core::at_end(cursor)) {
        return show_watchdog_status();
      }

      #if MK61_ENABLE_WATCHDOG_TEST
      if(strcmp(action, "test") == 0) {
        char mode[12];
        if(!terminal_core::parse_token(cursor, mode, sizeof(mode)) ||
           !terminal_core::at_end(cursor)) {
          print_watchdog_usage();
          return terminal_protocol::Result::error();
        }
        if(strcmp(mode, "starve") == 0) {
          terminal_output::field(
              Serial, "WDOG feed inhibited; reset expected within ", independent_watchdog::NOMINAL_TIMEOUT_MS);
          Serial.println(" nominal ms");
          Serial.flush();
          independent_watchdog::inhibit_for_test();
          return terminal_protocol::Result::ok();
        }
        if(strcmp(mode, "hang") == 0) {
          terminal_output::field(
              Serial, "WDOG foreground hang; reset expected within ", independent_watchdog::NOMINAL_TIMEOUT_MS);
          Serial.println(" nominal ms");
          Serial.flush();
          independent_watchdog::hang_for_test();
        }
      }
      #endif

      print_watchdog_usage();
      return terminal_protocol::Result::error();
    }

#endif
void class_terminal::print_memory_snapshot(shared_memory::Arena arena) {
      const shared_memory::Snapshot memory = shared_memory::snapshot(arena);
      terminal_output::field(Serial, "MEM ", shared_memory::arena_name(arena));
      terminal_output::field(Serial, " enabled=", memory.enabled ? 1 : 0);
      terminal_output::field(Serial, " capacity=", memory.capacity);
      terminal_output::field(Serial, " high=", memory.high_water);
      terminal_output::field(Serial, " resident_size=", memory.resident_size);
      terminal_output::field(Serial, " epoch=", memory.resident_epoch);
      terminal_output::field(
          Serial, " active=", shared_memory::owner_name(memory.active_owner));
      terminal_output::field(
          Serial, " resident=", shared_memory::owner_name(memory.resident_owner));
      terminal_output::field(Serial, " depth=", memory.active_depth);
      terminal_output::field(Serial, " max_depth=", memory.max_depth);
      terminal_output::field(Serial, " acquire=", memory.acquisitions);
      terminal_output::field(Serial, " nested=", memory.nested_acquisitions);
      terminal_output::field(Serial, " release=", memory.releases);
      terminal_output::field(Serial, " busy=", memory.busy_failures);
      terminal_output::field(Serial, " cache_defer=", memory.cache_deferrals);
      terminal_output::field(Serial, " invalid=", memory.invalid_failures);
      terminal_output::field(Serial, " switches=", memory.owner_switches);
      terminal_output::field(Serial, " clears=", memory.clears);
      terminal_output::field(Serial, " clear_bytes=", memory.cleared_bytes);
      terminal_output::field(Serial, " reclaim=", memory.reclaims);
      Serial.write('/');
      Serial.print(memory.reclaim_attempts);
      terminal_output::line(Serial, " reclaim_fail=", memory.reclaim_failures);
    }

terminal_protocol::Result class_terminal::exec_memory(void) {
      const char* args = terminal_skip_spaces(command_args());
      if(!terminal_core::at_end(args)) {
        char action[8];
        const char* cursor = args;
        if(!terminal_core::parse_token(cursor, action, sizeof(action)) ||
           strcmp(action, "reset") != 0 ||
           !terminal_core::at_end(cursor)) {
          Serial.println("Usage: mem [reset]");
          return terminal_protocol::Result::error();
        }
        shared_memory::reset_statistics();
        core_61::reset_hot_table_cache_statistics();
        workspace_swap::reset_statistics();
        mk61_crc32::reset_arbitration_statistics();
        Serial.println("MEM reset");
        return terminal_protocol::Result::ok();
      }
      for(usize index = 0; index < (usize) shared_memory::Arena::COUNT;
          index++) {
        print_memory_snapshot((shared_memory::Arena) index);
      }
      terminal_output::line(
          Serial, "MEM invariant=", shared_memory::validate_invariants() ? "ok" : "BROKEN");
      const core_61::HotTableCacheSnapshot core_cache =
          core_61::hot_table_cache_statistics();
      terminal_output::field(Serial, "MEM core-cache enabled=", core_cache.enabled ? 1 : 0);
      terminal_output::field(Serial, " level=", core_cache.level);
      terminal_output::field(Serial, " cached=", core_cache.cached ? 1 : 0);
      terminal_output::field(Serial, " bytes=", core_cache.bytes);
      terminal_output::field(Serial, " loads=", core_cache.loads);
      terminal_output::field(Serial, " evictions=", core_cache.evictions);
      terminal_output::line(Serial, " flash_steps=", core_cache.flash_steps);
      const workspace_swap::Statistics swap =
          workspace_swap::statistics();
      terminal_output::field(Serial, "MEM swap enabled=", swap.enabled ? 1 : 0);
      terminal_output::field(Serial, " valid=", swap.valid ? 1 : 0);
      terminal_output::field(Serial, " owner=", shared_memory::owner_name(swap.owner));
      terminal_output::field(Serial, " schema=", swap.schema);
      terminal_output::field(Serial, " codec=", swap.compressed ? "zx0" : "raw");
      terminal_output::field(Serial, " bytes=", swap.stored_size);
      Serial.write('/');
      Serial.print(swap.raw_size);
      terminal_output::field(Serial, " capture=", swap.captures);
      Serial.write('/');
      Serial.print(swap.capture_attempts);
      terminal_output::field(Serial, " restore=", swap.restores);
      terminal_output::field(Serial, " exchange=", swap.exchanges);
      Serial.write('/');
      Serial.print(swap.exchange_attempts);
      terminal_output::field(Serial, " exchange_fallback=", swap.exchange_fallbacks);
      terminal_output::field(Serial, " evict=", swap.evictions);
      terminal_output::field(Serial, " busy=", swap.busy_failures);
      terminal_output::field(Serial, " encode_fail=", swap.encode_failures);
      terminal_output::line(Serial, " integrity_fail=", swap.integrity_failures);
      const mk61_crc32::ArbitrationSnapshot crc =
          mk61_crc32::arbitration_statistics();
      terminal_output::field(Serial, "MEM crc-hw supported=", crc.supported ? 1 : 0);
      terminal_output::field(Serial, " busy=", crc.busy ? 1 : 0);
      terminal_output::field(Serial, " acquire=", crc.hardware_acquisitions);
      terminal_output::line(Serial, " fallback=", crc.software_fallbacks);
      return terminal_protocol::Result::ok();
    }

void class_terminal::print_display_status(void) {
      Serial.print("DISPLAY controller=");
#if defined(MK61_OLED1602_WS0010)
      Serial.print("WS0010 FT=10 wait=busy+floor ddram=2x64 cgram=8");
      Serial.print(" bf-seen=");
      Serial.print(main_lcd().busyFlagObserved() ? 1 : 0);
      terminal_output::field(Serial, " bf-timeouts=", main_lcd().busyFlagTimeouts());
      terminal_output::field(Serial, " bf-fault=", main_lcd().busyFlagFaulted() ? 1 : 0);
      Serial.print(" graphics=");
      if(!main_lcd().supportsWs0010Graphics()) {
        Serial.print("disabled");
      } else {
#if MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED && \
    MK61_WS0010_GRAPHICS_100X16
        Serial.print("qualified");
#else
        Serial.print("laboratory");
#endif
        Serial.print(" gdram=100x16 visible=80x16");
      }
      Serial.print(" brightness=software-unsupported");
      Serial.print(" mode=");
      Serial.print(main_lcd().graphicsMode() ? "graphics" : "character");
      terminal_output::field(
          Serial, " owner=", ws0010::graphicsOwnerName(main_lcd().ws0010GraphicsOwner()));
      terminal_output::field(Serial, " state=", main_lcd().displayEnabled() ? "on" : "off");
      terminal_output::field(
          Serial, " pwr=", main_lcd().internalPowerEnabled() ? "on" : "off");
      terminal_output::field(
          Serial, " route=", main_lcd().usbScreenActive() ? "usb-screen" : "oled");
      Serial.print(" sleep=");
      Serial.print(oled_protection::timeoutName(
        main_lcd().oledProtectionTimeout()));
      Serial.print(" boot=");
#if defined(RCC_CSR_PORRSTF) && defined(RCC_CSR_BORRSTF)
      const bool cold_start =
        (crash_dump::boot_reset_flags() &
         (RCC_CSR_PORRSTF | RCC_CSR_BORRSTF)) != 0;
      Serial.print(cold_start ? "cold" : "warm");
      Serial.print(" power-wait-ms=");
      Serial.print(cold_start ? ws0010::POWER_STABILIZATION_MS
                              : ws0010::RECOVERY_STABILIZATION_MS);
#else
      Serial.print("unknown power-wait-ms=unknown");
#endif
      Serial.print(" init=");
      Serial.print(ws0010::initializationPhaseName(
        main_lcd().initializationPhase()));
      terminal_output::line(Serial, " reinit=", main_lcd().reinitializationCount());
#elif defined(MK61_DISPLAY_UC1609)
      Serial.println("UC1609 mode=graphics");
#elif defined(MK61_LCD1602_A02)
      Serial.println("HD44780 cgrom=A02 ddram=2x40");
#else
      Serial.println("HD44780 cgrom=A00 ddram=2x40");
#endif
    }

void class_terminal::print_display_usage(void) {
#if defined(MK61_OLED1602_WS0010)
      Serial.println("Usage: display [status|reinit|on|off|test ...]; see help");
#else
      Serial.println("Usage: display [status]");
#endif
    }

#if defined(MK61_OLED1602_WS0010)
void class_terminal::display_test_text(void) {
      main_lcd().endWs0010Graphics();
      lcd_ru::restore_default_font();
      main_lcd().clear();
      static constexpr u16 row0[] = {
        'A', 'B', 'C', ' ', 0x0410, 0x0411, 0x0412, ' ',
        'U', 'S', 'B', '-', 'A', '1', '.', 'm'
      };
      static constexpr u16 row1[] = {
        0x0424, 0x0430, 0x0439, 0x043B, ' ',
        0x0401, 0x0451, ' ', 0x03C0, ' ', 0x00F7, ' ',
        0x2190, 0x2192, 0x00B0, '!'
      };
      for(u8 row = 0; row < lcd_display::ROWS; row++) {
        main_lcd().setCursor(0, row);
        const u16* text = row == 0 ? row0 : row1;
        for(u8 col = 0; col < lcd_display::COLS; col++) {
          main_lcd().writeCodepoint(text[col]);
        }
      }
    }

