bolknote/MK61S_MINI/code/terminal.cpp
void class_terminal::display_test_map(u8 page) {
      main_lcd().endWs0010Graphics();
      main_lcd().clear();
      const u8 first = (u8) (page << 5);
      for(u8 row = 0; row < lcd_display::ROWS; row++) {
        main_lcd().setCursor(0, row);
        for(u8 col = 0; col < lcd_display::COLS; col++) {
          main_lcd().write((u8) (first + row * lcd_display::COLS + col));
        }
      }
    }

void class_terminal::display_test_alphabet(u8 page) {
      main_lcd().endWs0010Graphics();
      lcd_ru::restore_default_font();
      main_lcd().clear();
      if(page < 2) {
        const bool lowercase = page != 0;
        for(u8 index = 0; index < 32; index++) {
          main_lcd().setCursor((u8) (index & 0x0Fu), (u8) (index >> 4));
          main_lcd().writeCodepoint(
            ws0010_charset::russianAlphabetCodepoint(lowercase, index));
        }
        return;
      }

      if(page == 3) {
        // FT=10 has no Ukrainian І/Ї/Є/Ґ. These eight glyphs exercise the
        // allocation-free CGRAM planner at its exact capacity.
        lcd_ru::print_lines("ІіЇїЄєҐґ", "CGRAM Unicode");
        return;
      }
      if(page == 4) {
        lcd_ru::print_lines("Ўў Belarus", "USB + Русский");
        return;
      }

      // The last alphabet characters plus deliberately interleaved Latin and
      // Cyrillic look-alikes. USB Screen must retain their Unicode identity
      // even where the WS0010 ROM intentionally shares a physical glyph.
      static constexpr u16 mixed[lcd_display::ROWS][lcd_display::COLS] = {
        { 0x042F, 0x044F, ' ', 'A', 0x0410, 'B', 0x0412,
          'C', 0x0421, 'E', 0x0415, 'H', 0x041D, 'K', 0x041A, ' ' },
        { 'M', 0x041C, 'O', 0x041E, 'P', 0x0420, 'T', 0x0422,
          'X', 0x0425, ' ', 0x0401, 0x0451, 0x042B, 0x044B, ' ' }
      };
      for(u8 row = 0; row < lcd_display::ROWS; row++) {
        main_lcd().setCursor(0, row);
        for(u8 col = 0; col < lcd_display::COLS; col++) {
          main_lcd().writeCodepoint(mixed[row][col]);
        }
      }
    }

void class_terminal::display_test_symbols(void) {
      main_lcd().endWs0010Graphics();
      lcd_ru::restore_default_font();
      main_lcd().clear();
      main_lcd().print("CGRAM ");
      for(u8 slot = 0; slot < 8; slot++) main_lcd().write(slot);
      main_lcd().setCursor(0, 1);
      static constexpr u16 symbols[] = {
        'R', 'O', 'M', ' ', 0x2190, 0x2192, 0x03C0, 0x00B0,
        0x00F7, ' ', '^', 'x', '-', ' ', ' ', ' '
      };
      for(u8 col = 0; col < lcd_display::COLS; col++) {
        main_lcd().writeCodepoint(symbols[col]);
      }
    }

void class_terminal::make_display_ddram(u8 cells[lcd_display::ROWS]
                                            [lcd_display::DDRAM_COLS]) {
      for(u8 row = 0; row < lcd_display::ROWS; row++) {
        for(u8 col = 0; col < lcd_display::DDRAM_COLS; col++) {
          // Every 16-column window carries its own row/page/column markers;
          // boundaries 39/40 and 63/0 therefore cannot pass by mirroring.
          const u8 within = col & 0x0Fu;
          if(within == 0) cells[row][col] = row == 0 ? 'U' : 'L';
          else if(within == 1) cells[row][col] = (u8) ('0' + (col >> 4));
          else cells[row][col] = (u8) ('A' + ((col - 2u) % 26u));
        }
      }
    }

void class_terminal::display_test_cgram(void) {
      main_lcd().endWs0010Graphics();
      main_lcd().clear();
      main_lcd().print("CGRAM AC:");
      u8 glyph[8];
      for(u8 slot = 0; slot < 8; slot++) {
        for(u8 row = 0; row < 8; row++) {
          glyph[row] = (u8) (((1u << (slot % 5u)) |
                              (row == slot ? 0x1Fu : 0u)) & 0x1Fu);
        }
        main_lcd().createChar(slot, glyph);
      }
      // Deliberately do not call clear()/setCursor() after createChar().  The
      // visible OK proves that the driver restored AC from CGRAM to the
      // logical DDRAM cursor instead of sending these bytes into glyph RAM.
      main_lcd().print("OK");
      main_lcd().setCursor(0, 1);
      for(u8 slot = 0; slot < 8; slot++) main_lcd().write(slot);
      main_lcd().print(" 0123456");
    }

terminal_protocol::Result class_terminal::display_test_graphics(u8 pattern) {
#if MK61_WS0010_GRAPHICS_100X16
      shared_memory::Lease frame(
        shared_memory::Arena::SCRATCH,
        shared_memory::Owner::DISPLAY_GRAPHICS,
        ws0010_graphics::FRAME_BYTES);
      if(!frame.ok()) {
        Serial.println("DISPLAY graphics busy");
        return terminal_protocol::Result::error();
      }
      ws0010_graphics::makeQualificationPattern(
        frame.data(), frame.size(), pattern);
      if(!main_lcd().showWs0010GraphicsQualificationFrame(
           frame.data(), frame.size())) {
        main_lcd().endWs0010Graphics();
        Serial.println("DISPLAY graphics failed; character mode restored");
        return terminal_protocol::Result::error();
      }
      terminal_output::field(Serial, "DISPLAY graphics pattern=", pattern);
      Serial.println(" shown; use 'display test restore'");
      return terminal_protocol::Result::ok();
#else
      (void) pattern;
      Serial.println("DISPLAY graphics qualification disabled; rebuild with MK61_WS0010_GRAPHICS_100X16=1 for the isolated experiment");
      return terminal_protocol::Result::error();
#endif
    }

#if MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED && \
    MK61_WS0010_GRAPHICS_100X16
terminal_protocol::Result class_terminal::display_test_graphics_readback(
        u8 pattern) {
      static constexpr usize FRAME_BYTES = ws0010_graphics::FRAME_BYTES;
      shared_memory::Lease frames(
        shared_memory::Arena::SCRATCH,
        shared_memory::Owner::DISPLAY_GRAPHICS,
        FRAME_BYTES * 2u);
      if(!frames.ok()) {
        Serial.println("DISPLAY graphics readback busy");
        return terminal_protocol::Result::error();
      }
      u8* const expected = frames.data();
      u8* const actual = expected + FRAME_BYTES;
      ws0010_graphics::makeQualificationPattern(
        expected, FRAME_BYTES, pattern);
      if(!main_lcd().showWs0010GraphicsQualificationFrame(
           expected, FRAME_BYTES)) {
        main_lcd().endWs0010Graphics();
        Serial.println("DISPLAY graphics readback write failed");
        return terminal_protocol::Result::error();
      }
      const bool read = main_lcd().readWs0010GraphicsQualificationFrame(
        actual, FRAME_BYTES);
      const bool restored = main_lcd().endWs0010Graphics();
      if(!read || !restored) {
        Serial.println(read
          ? "DISPLAY graphics readback character recovery failed"
          : "DISPLAY graphics readback transport failed");
        return terminal_protocol::Result::error();
      }

      usize mismatches = 0;
      usize first_mismatch = FRAME_BYTES;
      for(usize index = 0; index < FRAME_BYTES; index++) {
        if(expected[index] == actual[index]) continue;
        if(first_mismatch == FRAME_BYTES) first_mismatch = index;
        mismatches++;
      }
      const u32 expected_crc = mk61_crc32::calculate(expected, FRAME_BYTES);
      const u32 actual_crc = mk61_crc32::calculate(actual, FRAME_BYTES);
      terminal_output::field(Serial, "DISPLAY graphics readback pattern=", pattern);
      terminal_output::field(Serial, " bytes=", FRAME_BYTES);
      Serial.print(" expected=");
      terminal_print_hex_u32(expected_crc);
      Serial.print(" actual=");
      terminal_print_hex_u32(actual_crc);
      terminal_output::field(Serial, " mismatches=", mismatches);
      if(mismatches != 0) {
        terminal_output::field(Serial, " first=", first_mismatch);
      }
      Serial.println(" dummy=0");
      return mismatches == 0
           ? terminal_protocol::Result::ok()
           : terminal_protocol::Result::error();
    }

#endif
#endif
terminal_protocol::Result class_terminal::exec_display(void) {
      const char* cursor = command_args();
      if(terminal_core::at_end(cursor)) {
        print_display_status();
        return terminal_protocol::Result::ok();
      }
      char action[12];
      if(!terminal_core::parse_token(cursor, action, sizeof(action))) {
        print_display_usage();
        return terminal_protocol::Result::error();
      }
      if(strcmp(action, "status") == 0 && terminal_core::at_end(cursor)) {
        print_display_status();
        return terminal_protocol::Result::ok();
      }
#if !defined(MK61_OLED1602_WS0010)
      print_display_usage();
      return terminal_protocol::Result::error();
#else
      if(strcmp(action, "reinit") == 0 && terminal_core::at_end(cursor)) {
        const bool ok = main_lcd().reinitialize();
        Serial.println(ok ? "DISPLAY reinitialized" : "DISPLAY reinitialize failed");
        return ok ? terminal_protocol::Result::ok()
                  : terminal_protocol::Result::error();
      }
      if((strcmp(action, "on") == 0 || strcmp(action, "off") == 0) &&
         terminal_core::at_end(cursor)) {
        const bool enabled = action[1] == 'n';
        main_lcd().setDisplayEnabled(enabled, millis());
        Serial.println(enabled ? "DISPLAY on" : "DISPLAY off");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(action, "test") != 0) {
        print_display_usage();
        return terminal_protocol::Result::error();
      }
      char test[16];
      if(!terminal_core::parse_token(cursor, test, sizeof(test))) {
        print_display_usage();
        return terminal_protocol::Result::error();
      }
      if(strcmp(test, "text") == 0 && terminal_core::at_end(cursor)) {
        display_test_text();
        Serial.println("DISPLAY text test shown");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "map") == 0) {
        usize page = 0;
        if(!terminal_core::parse_unsigned(cursor, 10, 7, page) ||
           !terminal_core::at_end(cursor)) {
          Serial.println("Usage: display test map <0..7>");
          return terminal_protocol::Result::error();
        }
        display_test_map((u8) page);
        terminal_output::field(Serial, "DISPLAY byte map 0x", (u8) (page << 5), HEX);
        terminal_output::line(Serial, "..0x", (u8) ((page << 5) + 31u), HEX);
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "alphabet") == 0) {
        usize page = 0;
        if(!terminal_core::parse_unsigned(cursor, 10, 4, page) ||
           !terminal_core::at_end(cursor)) {
          Serial.println("Usage: display test alphabet <0..4>");
          return terminal_protocol::Result::error();
        }
        display_test_alphabet((u8) page);
        terminal_output::line(Serial, "DISPLAY Russian/mixed alphabet page=", page);
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "symbols") == 0 && terminal_core::at_end(cursor)) {
        display_test_symbols();
        Serial.println("DISPLAY ROM/CGRAM symbols shown");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "ddram") == 0) {
        usize shift = 0;
        if(!terminal_core::parse_unsigned(cursor, 10, 63, shift) ||
           !terminal_core::at_end(cursor)) {
          Serial.println("Usage: display test ddram <0..63>");
          return terminal_protocol::Result::error();
        }
        u8 cells[lcd_display::ROWS][lcd_display::DDRAM_COLS];
        make_display_ddram(cells);
        if(!main_lcd().shiftShiftedViewport(cells, (u8) shift)) {
          main_lcd().renderShiftedViewport(cells, (u8) shift);
        }
        terminal_output::line(Serial, "DISPLAY DDRAM shift=", shift);
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "row") == 0) {
        usize row = 0;
        usize shift = 0;
        if(!terminal_core::parse_unsigned(cursor, 10, 1, row) ||
           !terminal_core::parse_unsigned(cursor, 10, 63, shift) ||
           !terminal_core::at_end(cursor)) {
          Serial.println("Usage: display test row <0..1> <0..63>");
          return terminal_protocol::Result::error();
        }
        u8 cells[lcd_display::ROWS][lcd_display::DDRAM_COLS];
        make_display_ddram(cells);
        // Lowercase the selected row's payload so a photograph proves that
        // it was redrawn while the other row and common hardware shift stayed
        // untouched. Run `display test ddram 0` first for the clearest check.
        for(u8 col = 2; col < lcd_display::DDRAM_COLS; col++) {
          const u8 value = cells[row][col];
          if(value >= 'A' && value <= 'Z') {
            cells[row][col] = (u8) (value - 'A' + 'a');
          }
        }
        if(!main_lcd().updateWs0010ShiftedViewportRow(
             cells, (u8) row, (u8) shift)) {
          Serial.println("DISPLAY independent-row test failed");
          return terminal_protocol::Result::error();
        }
        terminal_output::field(Serial, "DISPLAY independent row=", row);
        terminal_output::line(Serial, " logical-shift=", shift);
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "cgram") == 0 && terminal_core::at_end(cursor)) {
        display_test_cgram();
        Serial.println("DISPLAY CGRAM/AC test shown; expect 'CGRAM AC:OK'");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "zero") == 0 && terminal_core::at_end(cursor)) {
        main_lcd().endWs0010Graphics();
        if(!main_lcd().showWs0010ZeroRunTest()) {
          Serial.println("DISPLAY zero-run test unavailable");
          return terminal_protocol::Result::error();
        }
        terminal_output::field(
            Serial, "DISPLAY zero-run=256 expect two OK markers bf-seen=", main_lcd().busyFlagObserved() ? 1 : 0);
        terminal_output::field(Serial, " bf-timeouts=", main_lcd().busyFlagTimeouts());
        terminal_output::line(Serial, " bf-fault=", main_lcd().busyFlagFaulted() ? 1 : 0);
        return main_lcd().busyFlagFaulted()
             ? terminal_protocol::Result::error()
             : terminal_protocol::Result::ok();
      }
      if(strcmp(test, "clear") == 0 && terminal_core::at_end(cursor)) {
        main_lcd().endWs0010Graphics();
        main_lcd().clear();
        main_lcd().setCursor(0, 0);
        main_lcd().cursorOn();
        Serial.println("DISPLAY clear; cursor expected at row=0 col=0");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "home") == 0 && terminal_core::at_end(cursor)) {
        main_lcd().endWs0010Graphics();
        if(!main_lcd().returnWs0010Home()) {
          Serial.println("DISPLAY home unavailable");
          return terminal_protocol::Result::error();
        }
        Serial.println("DISPLAY home; shift=0 address=0");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "cursor") == 0) {
        char direction[8] = {};
        const bool has_direction =
          terminal_core::parse_token(cursor, direction, sizeof(direction));
        if(!terminal_core::at_end(cursor) ||
           (has_direction && strcmp(direction, "left") != 0 &&
                             strcmp(direction, "right") != 0)) {
          Serial.println("Usage: display test cursor [left|right]");
          return terminal_protocol::Result::error();
        }
        main_lcd().endWs0010Graphics();
        main_lcd().clear();
        main_lcd().print("0123456789ABCDEF");
        main_lcd().setCursor(8, 1);
        main_lcd().print("X");
        main_lcd().setCursor(8, 1);
        main_lcd().cursorOn();
        main_lcd().blinkOn();
        if(has_direction && !main_lcd().shiftWs0010Cursor(
             strcmp(direction, "right") == 0)) {
          Serial.println("DISPLAY cursor shift failed");
          return terminal_protocol::Result::error();
        }
        Serial.print("DISPLAY cursor+blink at row=1 col=");
        Serial.println(has_direction ?
          (strcmp(direction, "right") == 0 ? 9 : 7) : 8);
        return terminal_protocol::Result::ok();
      }
      if((strcmp(test, "entry") == 0 || strcmp(test, "autoshift") == 0) &&
         terminal_core::at_end(cursor)) {
        main_lcd().endWs0010Graphics();
        const bool automatic_shift = strcmp(test, "autoshift") == 0;
        if(!main_lcd().showWs0010EntryModeTest(automatic_shift)) {
          Serial.println("DISPLAY entry-mode test unavailable");
          return terminal_protocol::Result::error();
        }
        Serial.println(automatic_shift
          ? "DISPLAY entry auto-shift=left one cell; use restore"
          : "DISPLAY entry decrement wrote CBA; normal entry restored");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "sleep") == 0 && terminal_core::at_end(cursor)) {
        main_lcd().endWs0010Graphics();
        main_lcd().setDisplayEnabled(false, millis());
        Serial.println("DISPLAY asleep; the next keyboard/terminal activity must wake it");
        return terminal_protocol::Result::ok();
      }
      if(strcmp(test, "graphics") == 0) {
        usize pattern = 0;
        if(!terminal_core::parse_unsigned(cursor, 10, 7, pattern) ||
           !terminal_core::at_end(cursor)) {
          Serial.println("Usage: display test graphics <0..7>");
          return terminal_protocol::Result::error();
        }
        return display_test_graphics((u8) pattern);
      }
#if MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED && \
    MK61_WS0010_GRAPHICS_100X16
      if(strcmp(test, "graphics-read") == 0) {
        usize pattern = 0;
        if(!terminal_core::parse_unsigned(cursor, 10, 7, pattern) ||
           !terminal_core::at_end(cursor)) {
          Serial.println("Usage: display test graphics-read <0..7>");
          return terminal_protocol::Result::error();
        }
        return display_test_graphics_readback((u8) pattern);
      }
#endif
      if(strcmp(test, "restore") == 0 && terminal_core::at_end(cursor)) {
        if(!main_lcd().endWs0010Graphics()) {
          Serial.println("DISPLAY character recovery failed");
          return terminal_protocol::Result::error();
        }
        lcd_ru::restore_default_font();
        extern void lcd_std_display_redraw(void);
        lcd_std_display_redraw();
        Serial.println("DISPLAY character UI restored");
        return terminal_protocol::Result::ok();
      }
      print_display_usage();
      return terminal_protocol::Result::error();
#endif
    }

const char* class_terminal::power_state_name(
        const power_monitor::Snapshot& snapshot) {
      if(!snapshot.supported) return "unsupported";
      if(snapshot.below_threshold) return "low";
      if(snapshot.recovering) return "recovering";
      return snapshot.initialized ? "stable" : "uninitialized";
    }

