bolknote/MK61S_MINI/code/terminal.cpp
      for(usize index = 0; index < dwt_profiler::POINT_COUNT; index++) {
        const dwt_profiler::Point point = (dwt_profiler::Point) index;
        const dwt_profiler::Statistics& stats =
          dwt_profiler::statistics(point);
        report.append_text(dwt_profiler::point_name(point));
        report.append_char(',');
        report.append_u64(stats.samples);
        report.append_char(',');
        report.append_u64(stats.minimum_cycles);
        report.append_char(',');
        report.append_u64(stats.average_cycles());
        report.append_char(',');
        report.append_u64(stats.maximum_cycles);
        report.append_char(',');
        report.append_u64(stats.total_cycles);
        report.append_char('\n');
      }

      return report.valid() && report.length() <= 0xFFFFU
          ? (u16) report.length() : 0;
    }

terminal_protocol::Result class_terminal::save_profile_report(const char* path) {
      storage_path::FileTarget target = {};
      const storage_path::Status path_status = storage_path::file_target(
          current_directory, path, program_store::ProgramType::TEXT, target);
      if(path_status != storage_path::Status::OK) {
        terminal_path_error("prof save", path_status);
        return terminal_protocol::Result::error();
      }

      // Фиксируем непротиворечивый снимок: сама запись C5 больше не меняет
      // счётчики flash.write и прочих профилируемых участков.
      dwt_profiler::stop();
      shared_scratch::Lease scratch(
          shared_scratch::Owner::TERMINAL_TRANSFER,
          program_store::MAX_MK61_TEXT_SIZE);
      if(!scratch.ok()) {
        Serial.println("PROF save busy");
        return terminal_protocol::Result::error();
      }
      const u16 length = build_profile_report(
          scratch.data(), scratch.size());
      if(length == 0 ||
         !program_store::write_file(
             target.parent_id, program_store::INVALID_ID,
             program_store::ProgramType::TEXT, target.name,
             scratch.data(), length)) {
        Serial.println("PROF save failed");
        return terminal_protocol::Result::error();
      }

      terminal_output::field(Serial, "PROF saved ", path);
      terminal_output::line(Serial, " bytes=", length);
      return terminal_protocol::Result::ok();
    }

#endif
terminal_protocol::Result class_terminal::exec_profile(void) {
      const char* args = command_args();
      if(terminal_core::at_end(args)) {
        print_profile_statistics();
        return terminal_protocol::Result::ok();
      }

      const char* cursor = args;
      char action[8];
      if(!terminal_core::parse_token(cursor, action, sizeof(action))) {
#if MK61_ENABLE_PROFILE_SAVE
        Serial.println("Usage: prof [start|stop|reset|save [path.txt]]");
#else
        Serial.println("Usage: prof [start|stop|reset|core [steps]]");
#endif
        return terminal_protocol::Result::error();
      }
#if MK61_ENABLE_PROFILE_SAVE
      if(strcmp(action, "save") == 0) {
        char path[MAX_INPUT_CHAR];
        if(terminal_core::at_end(cursor)) {
          bounded_string::copy(path, "PROFILE.TXT");
        } else if(!terminal_copy_arg(path, sizeof(path), cursor)) {
          Serial.println("Usage: prof save [path.txt]");
          return terminal_protocol::Result::error();
        }
        return save_profile_report(path);
      }
#endif
      if(strcmp(action, "core") == 0) {
        usize steps = 40;
        if(!terminal_core::at_end(cursor) &&
           !terminal_core::parse_single_unsigned(
               cursor, 10, 1000, steps)) {
          Serial.println("Usage: prof core [1..1000]");
          return terminal_protocol::Result::error();
        }
        if(steps == 0) {
          Serial.println("Usage: prof core [1..1000]");
          return terminal_protocol::Result::error();
        }
        if(core_61::is_RUN()) {
          Serial.println("PROF core busy: calculator is running");
          return terminal_protocol::Result::error();
        }

        core_61::ContextBuffer* saved = core_61::acquire_context_buffer(
            core_61::ContextBufferOwner::BENCHMARK);
        if(saved == nullptr) {
          Serial.println("PROF core busy: context buffer is owned");
          return terminal_protocol::Result::error();
        }
        if(!core_61::save_context(*saved)) {
          (void) core_61::release_context_buffer(
              core_61::ContextBufferOwner::BENCHMARK);
          Serial.println("PROF core failed: cannot save calculator state");
          return terminal_protocol::Result::error();
        }
        // The live state is safely parked in the shared slot.  Seed the same
        // volatile core state on every board/build so results do not depend on
        // the user's current X register, program, key latch or angle mode.
        core_61::enable();
        if(!dwt_profiler::start()) {
          (void) core_61::restore_context(*saved);
          (void) core_61::release_context_buffer(
              core_61::ContextBufferOwner::BENCHMARK);
          Serial.println("PROF unavailable");
          return terminal_protocol::Result::error();
        }

        for(usize index = 0; index < steps; index++) {
          core_61::step();
        }
        dwt_profiler::stop();
        const bool restored = core_61::restore_context(*saved);
        core_61::ContextBuffer verification = {};
        const bool verified = restored &&
            core_61::save_context(verification) &&
            memcmp(saved->bytes, verification.bytes,
                   sizeof(verification.bytes)) == 0;
        if(!verified) {
          // Keep the original slot intact and make one final best-effort
          // restore before reporting a failed non-destructive benchmark.
          (void) core_61::restore_context(*saved);
        }
        const bool released = core_61::release_context_buffer(
            core_61::ContextBufferOwner::BENCHMARK);
        if(!verified || !released) {
          Serial.println("PROF core failed: calculator restore error");
          return terminal_protocol::Result::error();
        }

        terminal_output::field(Serial, "PROF corebench steps=", steps);
        Serial.println(" restored=1");
        print_profile_statistics();
        return terminal_protocol::Result::ok();
      }
#if MK61_DEEP_IDLE_SUPPORTED
      if(strcmp(action, "deep") == 0) {
        char subaction[8];
        const char* probe = cursor;
        if(terminal_core::parse_token(
               probe, subaction, sizeof(subaction)) &&
           strcmp(subaction, "cancel") == 0 &&
           terminal_core::at_end(probe)) {
          if(!deep_idle::cancel()) {
            Serial.println("PROF deep: no pending request");
            return terminal_protocol::Result::error();
          }
          Serial.println("PROF deep cancelled");
          return terminal_protocol::Result::ok();
        }

