bolknote/MK61S_MINI/code/terminal.cpp
      terminal_output::field(Serial, "BENCH kind=file path=", path);
      terminal_output::field(Serial, " bytes=", entry.data_len);
      terminal_output::line(Serial, " passes=", passes);

      alignas(4) u8 data[program_store::MAX_MK61_TEXT_SIZE];
      read_benchmark::Summary summary;
      for(usize pass = 0; pass < passes; pass++) {
        u16 recovered = 0;
        const u32 started_at = micros();
        const bool read_ok = program_store::read_id(
            entry.id, data, sizeof(data), &recovered);
        const u32 elapsed_us = (u32) (micros() - started_at);
        if(!read_ok || recovered != entry.data_len) {
          Serial.println("BENCH error=read");
          return terminal_protocol::Result::error();
        }
        const u32 crc = mk61_crc32::calculate(data, recovered);
        print_benchmark_pass((u8) (pass + 1), elapsed_us, crc);
        if(!summary.add(elapsed_us, crc)) {
          Serial.println("BENCH error=data-mismatch");
          return terminal_protocol::Result::error();
        }
      }
      return print_benchmark_summary("file", entry.data_len, summary);
    }

terminal_protocol::Result class_terminal::benchmark_flash(const char* cursor) {
      usize bytes = 64U * 1024U;
      usize passes = 3;
      if(!terminal_core::at_end(cursor) &&
         !terminal_core::parse_unsigned(cursor, 10, 1024U * 1024U, bytes)) {
        Serial.println("Usage: bench flash [1..1048576 bytes] [1..20 passes]");
        return terminal_protocol::Result::error();
      }
      if(!terminal_core::at_end(cursor) &&
         !terminal_core::parse_unsigned(cursor, 10, 20, passes)) {
        Serial.println("Usage: bench flash [1..1048576 bytes] [1..20 passes]");
        return terminal_protocol::Result::error();
      }
      if(bytes == 0 || passes == 0 || !terminal_core::at_end(cursor) ||
         !program_store::ready()) {
        Serial.println("Usage: bench flash [1..1048576 bytes] [1..20 passes]");
        return terminal_protocol::Result::error();
      }

      const storage_geometry::Geometry& geometry = program_store::geometry();
      const u32 address = geometry.data_first_sector *
                          storage_geometry::PHYSICAL_SECTOR_SIZE;
      const u32 available = geometry.data_sector_count *
                            storage_geometry::PHYSICAL_SECTOR_SIZE;
      if(bytes > available) {
        terminal_output::line(Serial, "BENCH error=range max=", available);
        return terminal_protocol::Result::error();
      }

      terminal_output::field(Serial, "BENCH kind=flash address=", address);
      terminal_output::field(Serial, " bytes=", bytes);
      terminal_output::line(Serial, " passes=", passes);

      alignas(4) u8 block[512];
      read_benchmark::Summary summary;
      for(usize pass = 0; pass < passes; pass++) {
        mk61_crc32::Context crc;
        u32 elapsed_us = 0;
        for(u32 offset = 0; offset < bytes;) {
          const usize remaining = bytes - offset;
          const usize count = remaining < sizeof(block)
              ? remaining : sizeof(block);
          const u32 started_at = micros();
          const bool read_ok = external_flash().readByteArray(
              address + offset, block, count);
          elapsed_us += (u32) (micros() - started_at);
          if(!read_ok || !crc.update(block, count)) {
            Serial.println("BENCH error=read");
            return terminal_protocol::Result::error();
          }
          offset += (u32) count;
        }
        const u32 checksum = crc.finish();
        print_benchmark_pass((u8) (pass + 1), elapsed_us, checksum);
        if(!summary.add(elapsed_us, checksum)) {
          Serial.println("BENCH error=data-mismatch");
          return terminal_protocol::Result::error();
        }
      }
      return print_benchmark_summary("flash", (u32) bytes, summary);
    }

terminal_protocol::Result class_terminal::benchmark_random(const char* cursor) {
      usize reads = 1024;
      usize passes = 3;
      if(!terminal_core::at_end(cursor) &&
         !terminal_core::parse_unsigned(cursor, 10, 8192, reads)) {
        Serial.println("Usage: bench random [1..8192 reads] [1..20 passes]");
        return terminal_protocol::Result::error();
      }
      if(!terminal_core::at_end(cursor) &&
         !terminal_core::parse_unsigned(cursor, 10, 20, passes)) {
        Serial.println("Usage: bench random [1..8192 reads] [1..20 passes]");
        return terminal_protocol::Result::error();
      }
      if(reads == 0 || passes == 0 || !terminal_core::at_end(cursor) ||
         !program_store::ready()) {
        Serial.println("Usage: bench random [1..8192 reads] [1..20 passes]");
        return terminal_protocol::Result::error();
      }

      static constexpr u32 BLOCK_SIZE = 512;
      static constexpr u32 SEED = 0x61C5F411UL;
      const storage_geometry::Geometry& geometry = program_store::geometry();
      const u32 first_block = geometry.data_first_sector *
                              storage_geometry::PHYSICAL_SECTOR_SIZE /
                              BLOCK_SIZE;
      const u32 block_count = geometry.data_sector_count *
                              storage_geometry::PHYSICAL_SECTOR_SIZE /
                              BLOCK_SIZE;
      if(block_count == 0) {
        Serial.println("BENCH error=range");
        return terminal_protocol::Result::error();
      }

      terminal_output::field(Serial, "BENCH kind=random reads=", reads);
      terminal_output::field(Serial, " bytes=", (u32) reads * BLOCK_SIZE);
      terminal_output::field(Serial, " passes=", passes);
      Serial.print(" seed=0x");
      terminal_print_hex_u32(SEED);
      Serial.println();

      alignas(4) u8 block[BLOCK_SIZE];
      read_benchmark::Summary summary;
      for(usize pass = 0; pass < passes; pass++) {
        mk61_crc32::Context crc;
        u32 state = SEED;
        u32 elapsed_us = 0;
        for(usize sample = 0; sample < reads; sample++) {
          state = state * 1664525UL + 1013904223UL;
          const u32 address = (first_block + state % block_count) * BLOCK_SIZE;
          const u32 started_at = micros();
          const bool read_ok = external_flash().readByteArray(
              address, block, sizeof(block));
          elapsed_us += (u32) (micros() - started_at);
          if(!read_ok || !crc.update(block, sizeof(block))) {
            Serial.println("BENCH error=read");
            return terminal_protocol::Result::error();
          }
        }
        const u32 checksum = crc.finish();
        print_benchmark_pass((u8) (pass + 1), elapsed_us, checksum);
        if(!summary.add(elapsed_us, checksum)) {
          Serial.println("BENCH error=data-mismatch");
          return terminal_protocol::Result::error();
        }
      }
      return print_benchmark_summary(
          "random", (u32) reads * BLOCK_SIZE, summary);
    }

terminal_protocol::Result class_terminal::exec_benchmark(void) {
      const char* cursor = command_args();
      char kind[8];
      if(!terminal_core::parse_token(cursor, kind, sizeof(kind))) {
        Serial.println("Usage: bench <file|flash|random> ...");
        return terminal_protocol::Result::error();
      }
      if(strcmp(kind, "file") == 0) return benchmark_file(cursor);
      if(strcmp(kind, "flash") == 0) return benchmark_flash(cursor);
      if(strcmp(kind, "random") == 0) return benchmark_random(cursor);
      Serial.println("Usage: bench <file|flash|random> ...");
      return terminal_protocol::Result::error();
    }

#endif
terminal_protocol::Result class_terminal::exec_date(void) {
      const char* args = command_args();
      const char* option_cursor = args;
      char option[3] = {};
      const bool precise = terminal_core::parse_token(
          option_cursor, option, sizeof(option)) &&
          strcmp(option, "ms") == 0 &&
          terminal_core::at_end(option_cursor);
      const rtc_clock::TerminalRequest request = precise
          ? rtc_clock::TerminalRequest{
              rtc_clock::TerminalAction::SHOW, {0, 0, 0, 0, 0, 0}}
          : rtc_clock::parse_date_request(args);
      if(request.action == rtc_clock::TerminalAction::INVALID) {
        Serial.println("DATE ERROR: expected ms or YYYY-MM-DD HH:MM:SS");
        return terminal_protocol::Result::error();
      }

