bolknote/MK61S_MINI/code/terminal.cpp
      if(request.action == rtc_clock::TerminalAction::SET) {
        if(!rtc_clock::set(request.date_time)) {
          Serial.println("DATE ERROR");
          return terminal_protocol::Result::error();
        }
        Serial.println("DATE OK");
        return terminal_protocol::Result::ok();
      }

      rtc_clock::StartupSnapshot snapshot = {};
      char text[rtc_clock::DATETIME_TEXT_SIZE];
      if(!rtc_clock::startup_snapshot(snapshot) ||
         !rtc_clock::format_datetime(snapshot.date_time, text)) {
        Serial.println("DATE ERROR");
        return terminal_protocol::Result::error();
      }
      Serial.print(text);
      if(precise) {
        const u16 milliseconds = rtc_clock::snapshot_milliseconds(snapshot);
        Serial.write('.');
        Serial.write((u8) ('0' + milliseconds / 100));
        Serial.write((u8) ('0' + (milliseconds / 10) % 10));
        Serial.write((u8) ('0' + milliseconds % 10));
      }
      Serial.println();
      if(!snapshot.time_set) Serial.println("Set the date.");
      return terminal_protocol::Result::ok();
    }

#if MK61_ENABLE_RTC_ALARM_TERMINAL
char class_terminal::alarm_id_letter(rtc_clock::AlarmId id) {
      return id == rtc_clock::AlarmId::A ? 'A' : 'B';
    }

void class_terminal::print_two_digits(u8 value) {
      Serial.write((u8) ('0' + value / 10));
      Serial.write((u8) ('0' + value % 10));
    }

void class_terminal::print_alarm_line(rtc_clock::AlarmId id) {
      rtc_clock::Alarm alarm = {};
      Serial.print("RTC ALARM ");
      Serial.write((u8) alarm_id_letter(id));
      if(!rtc_clock::read_alarm(id, alarm)) {
        Serial.println(" error");
        return;
      }
      if(!alarm.enabled) {
        Serial.println(" off");
        return;
      }
      Serial.write(' ');
      Serial.print(rtc_backup_layout::repeat_name(alarm.repeat));
      Serial.write(' ');
      if(alarm.repeat == rtc_clock::Repeat::ONE_SHOT) {
        char text[rtc_clock::DATETIME_TEXT_SIZE];
        if(rtc_clock::format_datetime(alarm.when, text)) {
          Serial.print(text);
          if(alarm.millisecond != rtc_backup_layout::MILLISECOND_IGNORED) {
            Serial.write('.');
            Serial.write((u8) ('0' + alarm.millisecond / 100));
            Serial.write((u8) ('0' + (alarm.millisecond / 10) % 10));
            Serial.write((u8) ('0' + alarm.millisecond % 10));
          }
          Serial.println();
        } else {
          Serial.println("invalid");
        }
        return;
      }
      print_two_digits(alarm.when.hour);
      Serial.write(':');
      print_two_digits(alarm.when.minute);
      Serial.write(':');
      print_two_digits(alarm.when.second);
      Serial.println();
    }

void class_terminal::print_alarm_status(void) {
      rtc_clock::BackupStatus status = {};
      (void) rtc_clock::backup_status(status);
      terminal_output::field(Serial, "RTC META valid=", status.valid ? 1 : 0);
      terminal_output::field(Serial, " boot-valid=", status.valid_at_boot ? 1 : 0);
      terminal_output::field(Serial, " boot=", status.boot_count);
      terminal_output::field(Serial, " reset=0x", status.reset_flags, HEX);
      terminal_output::field(
          Serial, " wake=", rtc_backup_layout::wake_reason_name(status.last_wake));
      terminal_output::field(Serial, " power-fail=", status.previous_power_unstable ? 1 : 0);
      terminal_output::line(Serial, " arm-fail=", status.alarm_arm_failures);
      print_alarm_line(rtc_clock::AlarmId::A);
      print_alarm_line(rtc_clock::AlarmId::B);
    }

terminal_protocol::Result class_terminal::exec_alarm(void) {
      const char* cursor = command_args();
      if(terminal_core::at_end(cursor)) {
        print_alarm_status();
        return terminal_protocol::Result::ok();
      }

      char slot[2] = {};
      char action[8] = {};
      if(!terminal_core::parse_token(cursor, slot, sizeof(slot)) ||
         !terminal_core::parse_token(cursor, action, sizeof(action)) ||
         slot[1] != 0 || (slot[0] != 'a' && slot[0] != 'A' &&
                         slot[0] != 'b' && slot[0] != 'B')) {
        Serial.println("Usage: alarm <a|b> <off|at|daily|in> ...");
        return terminal_protocol::Result::error();
      }
      const rtc_clock::AlarmId id = slot[0] == 'a' || slot[0] == 'A'
          ? rtc_clock::AlarmId::A : rtc_clock::AlarmId::B;

      bool ok = false;
      if(strcmp(action, "off") == 0 && terminal_core::at_end(cursor)) {
        ok = rtc_clock::cancel_alarm(id);
      } else if(strcmp(action, "at") == 0) {
        rtc_clock::DateTime when = {};
        ok = rtc_clock::parse_datetime(cursor, when) &&
            rtc_clock::schedule_alarm(
                id, {true, rtc_clock::Repeat::ONE_SHOT, when,
                     rtc_backup_layout::MILLISECOND_IGNORED});
      } else if(strcmp(action, "daily") == 0) {
        rtc_clock::DateTime when = {};
        ok = rtc_clock::parse_time_of_day(cursor, when) &&
            rtc_clock::schedule_alarm(
                id, {true, rtc_clock::Repeat::DAILY, when,
                     rtc_backup_layout::MILLISECOND_IGNORED});
      } else if(strcmp(action, "in") == 0) {
        usize seconds = 0;
        ok = terminal_core::parse_unsigned(
                 cursor, 10, 31536000UL, seconds) &&
             terminal_core::at_end(cursor) &&
             rtc_clock::schedule_after(id, (u32) seconds);
      } else {
        Serial.println("Usage: alarm <a|b> off | at YYYY-MM-DD HH:MM:SS | daily HH:MM:SS | in <seconds>");
        return terminal_protocol::Result::error();
      }

      Serial.println(ok ? "ALARM OK" : "ALARM ERROR");
      return ok ? terminal_protocol::Result::ok()
                : terminal_protocol::Result::error();
    }

#endif
u16 class_terminal::file_capacity(program_store::ProgramType type) {
      if(type == program_store::ProgramType::TINYBASIC) {
        return program_store::MAX_TINYBASIC_TEXT_SIZE;
      }
      if(type == program_store::ProgramType::IMAGE1) {
        return program_store::MAX_IMAGE1_SIZE;
      }
      if(type == program_store::ProgramType::FONT) {
        return program_store::MAX_FONT_SIZE;
      }
      if(type == program_store::ProgramType::CHIP8) {
        return program_store::MAX_CHIP8_SIZE;
      }
      if(type == program_store::ProgramType::APP) {
        return program_store::MAX_APP_FILE_SIZE;
      }
      return program_store::MAX_MK61_TEXT_SIZE;
    }

void class_terminal::cancel_file_upload(void) {
      if(file_upload_active && program_store::ready()) {
        program_store::vfat_stage_forget(FILE_UPLOAD_STAGE_FIRST_KEY,
                                         FILE_UPLOAD_STAGE_BLOCKS);
      }
      if(file_upload_active) program_store::vfat_stage_unlock();
      (void) language_workspace::discard(
          language_workspace::Owner::TERMINAL_TRANSFER);
      file_upload_active = false;
      file_upload_size = 0;
      file_upload_received = 0;
      file_upload_checksum = 0;
      file_upload_checksum_state = 0;
    }

bool class_terminal::read_staged_file_upload(void* context, u32 offset,
                                        u8* output, usize size) {
      if(context == NULL || output == NULL) return false;
      const u16 length = *(u16*) context;
      if(offset > length || size > length - offset) return false;
      // Upload is complete before this source is read. Its existing sector
      // buffer is free; the narrowed staging index starts after that sector.
      language_workspace::Lease workspace(
          language_workspace::Owner::TERMINAL_TRANSFER,
          FILE_UPLOAD_WORKSPACE_SIZE);
      if(!workspace.ok() || workspace.fresh()) return false;
      u8* const block = (u8*) workspace.data();
      while(size != 0) {
        const u16 block_index =
            (u16) (offset / program_store::VFAT_STAGE_BLOCK_SIZE);
        const u16 in_block =
            (u16) (offset % program_store::VFAT_STAGE_BLOCK_SIZE);
        usize count = program_store::VFAT_STAGE_BLOCK_SIZE - in_block;
        if(count > size) count = size;
        if(block_index >= FILE_UPLOAD_STAGE_BLOCKS ||
           !program_store::vfat_stage_read(
               FILE_UPLOAD_STAGE_FIRST_KEY + block_index, block)) {
          return false;
        }
        memcpy(output, block + in_block, count);
        output += count;
        offset += (u32) count;
        size -= count;
      }
      return true;
    }

terminal_protocol::Result class_terminal::file_transfer_error(const char* code) {
      cancel_file_upload();
      Serial.print("@MKC:ERROR ");
      Serial.println(code);
      return terminal_protocol::Result::error();
    }

