bolknote/MK61S_MINI/code/terminal.cpp
terminal_protocol::Result class_terminal::exec_fs_get(void) {
      char path[MAX_INPUT_CHAR];
      if(!terminal_single_token(command_args(), path, sizeof(path))) {
        return file_transfer_error("GET_USAGE");
      }
      program_store::Entry entry;
      if(storage_path::resolve_file(current_directory, path, entry) !=
         storage_path::Status::OK) {
        return file_transfer_error("GET_NOT_FOUND");
      }

      const u16 length = entry.data_len;
      u8 bytes[terminal_file_transfer::CHUNK_SIZE];
      u32 crc_state = 0;
      for(u16 offset = 0; offset < length;) {
        const u16 remaining = (u16) (length - offset);
        const u16 count = remaining < sizeof(bytes)
            ? remaining : (u16) sizeof(bytes);
        u16 copied = 0;
        if(!program_store::read_range_id(entry.id, offset, bytes, count,
                                         &copied) || copied != count) {
          return file_transfer_error("GET_IO");
        }
        for(u16 index = 0; index < count; index++) {
          crc_state = terminal_file_transfer::checksum_update(crc_state,
                                                               bytes[index]);
        }
        offset = (u16) (offset + count);
      }
      const u32 crc = terminal_file_transfer::checksum_finish(crc_state,
                                                               length);
      Serial.print("@MKC:GET ");
      Serial.print(length);
      Serial.write(' ');
      Serial.println(crc);
      for(u16 offset = 0; offset < length;) {
        const u16 remaining = (u16) (length - offset);
        const u16 count = remaining < terminal_file_transfer::CHUNK_SIZE
            ? remaining : (u16) terminal_file_transfer::CHUNK_SIZE;
        u16 copied = 0;
        if(!program_store::read_range_id(entry.id, offset, bytes, count,
                                         &copied) || copied != count) {
          return file_transfer_error("GET_IO");
        }
        Serial.print("@MKC:DATA ");
        Serial.print(offset);
        Serial.write(' ');
        for(u16 index = 0; index < count; index++) {
          const u8 value = bytes[index];
          Serial.write(terminal_file_transfer::hex_char((u8) (value >> 4)));
          Serial.write(terminal_file_transfer::hex_char((u8) (value & 0x0F)));
        }
        Serial.println();
        offset = (u16) (offset + count);
      }
      Serial.print("@MKC:END ");
      Serial.print(length);
      Serial.write(' ');
      Serial.println(crc);
      return terminal_protocol::Result::ok();
    }

terminal_protocol::Result class_terminal::exec_fs_put(void) {
      const char* cursor = command_args();
      char action[16];
      if(!terminal_core::parse_token(cursor, action, sizeof(action))) {
        return file_transfer_error("PUT_USAGE");
      }

      if(strcmp(action, "cancel") == 0) {
        if(!terminal_core::at_end(cursor)) {
          return file_transfer_error("PUT_USAGE");
        }
        cancel_file_upload();
        Serial.println("@MKC:CANCELLED");
        return terminal_protocol::Result::ok();
      }

      if(strcmp(action, "begin") == 0) {
        char path[MAX_INPUT_CHAR];
        usize length = 0;
        usize crc = 0;
        if(!terminal_core::parse_token(cursor, path, sizeof(path)) ||
           !terminal_core::parse_unsigned(cursor, 10,
               0xFFFFU, length) ||
           !terminal_core::parse_unsigned(cursor, 10, 0xFFFFFFFFu, crc) ||
           !terminal_core::at_end(cursor)) {
          return file_transfer_error("PUT_USAGE");
        }
        cancel_file_upload();
        storage_path::FileTarget target = {};
        if(storage_path::file_target(current_directory, path, target) !=
           storage_path::Status::OK) {
          return file_transfer_error("PUT_NAME");
        }
        if(length > file_capacity(target.type)) {
          return file_transfer_error("PUT_TOO_LARGE");
        }
        language_workspace::Lease workspace(
            language_workspace::Owner::TERMINAL_TRANSFER,
            FILE_UPLOAD_WORKSPACE_SIZE);
        if(!workspace.ok()) return file_transfer_error("PUT_BUSY");
        if(!program_store::vfat_stage_lock()) {
          return file_transfer_error("PUT_BUSY");
        }
        memset(workspace.data(), 0, program_store::VFAT_STAGE_BLOCK_SIZE);
        file_upload_target = target;
        file_upload_size = (u16) length;
        file_upload_received = 0;
        file_upload_checksum = (u32) crc;
        file_upload_checksum_state = 0;
        file_upload_active = true;
        Serial.print("@MKC:READY ");
        Serial.println(file_upload_size);
        return terminal_protocol::Result::ok();
      }

      if(strcmp(action, "data") == 0) {
        usize offset = 0;
        char hex[terminal_file_transfer::CHUNK_SIZE * 2 + 1];
        if(!file_upload_active ||
           !terminal_core::parse_unsigned(cursor, 10,
               0xFFFFU, offset) ||
           !terminal_core::parse_token(cursor, hex, sizeof(hex)) ||
           !terminal_core::at_end(cursor)) {
          return file_transfer_error("PUT_SEQUENCE");
        }
        u8 decoded[terminal_file_transfer::CHUNK_SIZE];
        usize decoded_length = 0;
        if(!terminal_file_transfer::decode_hex(hex, decoded,
                                               sizeof(decoded),
                                               decoded_length) ||
           decoded_length == 0 || offset != file_upload_received ||
           offset + decoded_length > file_upload_size) {
          return file_transfer_error("PUT_DATA");
        }
        language_workspace::Lease workspace(
            language_workspace::Owner::TERMINAL_TRANSFER,
            FILE_UPLOAD_WORKSPACE_SIZE);
        if(!workspace.ok() || workspace.fresh()) {
          return file_transfer_error("PUT_INTERRUPTED");
        }
        usize copied = 0;
        while(copied < decoded_length) {
          const u16 position = (u16) (offset + copied);
          const u16 block_index =
              position / program_store::VFAT_STAGE_BLOCK_SIZE;
          const u16 in_block =
              position % program_store::VFAT_STAGE_BLOCK_SIZE;
          usize count = program_store::VFAT_STAGE_BLOCK_SIZE - in_block;
          if(count > decoded_length - copied) {
            count = decoded_length - copied;
          }
          memcpy((u8*) workspace.data() + in_block,
                 decoded + copied, count);
          for(usize index = 0; index < count; index++) {
            file_upload_checksum_state =
                terminal_file_transfer::checksum_update(
                    file_upload_checksum_state, decoded[copied + index]);
          }
          copied += count;
          if(in_block + count == program_store::VFAT_STAGE_BLOCK_SIZE) {
            if(block_index >= FILE_UPLOAD_STAGE_BLOCKS ||
               !program_store::vfat_stage_write(
                   FILE_UPLOAD_STAGE_FIRST_KEY + block_index,
                   (const u8*) workspace.data())) {
              return file_transfer_error("PUT_IO");
            }
            memset(workspace.data(), 0,
                   program_store::VFAT_STAGE_BLOCK_SIZE);
          }
        }
        file_upload_received = (u16) (offset + decoded_length);
        Serial.print("@MKC:ACK ");
        Serial.println(file_upload_received);
        return terminal_protocol::Result::ok();
      }

      if(strcmp(action, "end") == 0) {
        if(!file_upload_active || !terminal_core::at_end(cursor) ||
           file_upload_received != file_upload_size) {
          return file_transfer_error("PUT_INCOMPLETE");
        }
        language_workspace::Lease workspace(
            language_workspace::Owner::TERMINAL_TRANSFER,
            FILE_UPLOAD_WORKSPACE_SIZE);
        if(!workspace.ok() || workspace.fresh()) {
          return file_transfer_error("PUT_INTERRUPTED");
        }
        if(file_upload_size % program_store::VFAT_STAGE_BLOCK_SIZE != 0) {
          const u16 block =
              file_upload_size / program_store::VFAT_STAGE_BLOCK_SIZE;
          if(block >= FILE_UPLOAD_STAGE_BLOCKS ||
             !program_store::vfat_stage_write(
                 FILE_UPLOAD_STAGE_FIRST_KEY + block,
                 (const u8*) workspace.data())) {
            return file_transfer_error("PUT_IO");
          }
        }
        const u32 crc = terminal_file_transfer::checksum_finish(
            file_upload_checksum_state, file_upload_size);
        if(crc != file_upload_checksum) {
          return file_transfer_error("PUT_CHECKSUM");
        }
        u8* const workspace_bytes = (u8*) workspace.data();
        u32* const narrow_index = reinterpret_cast<u32*>(
            workspace_bytes + program_store::VFAT_STAGE_BLOCK_SIZE);
        if(!program_store::vfat_stage_narrow(
             FILE_UPLOAD_STAGE_FIRST_KEY, FILE_UPLOAD_STAGE_BLOCKS,
             narrow_index, FILE_UPLOAD_STAGE_BLOCKS)) {
          return file_transfer_error("PUT_BUSY");
        }
        const program_store::FileSource source = {
          &file_upload_size, read_staged_file_upload
        };
#if MK61_ANY_LOADABLE_MODULE
        if(file_upload_target.type == program_store::ProgramType::APP) {
          const loadable_module::ModuleSource app_source = {
            &file_upload_size, file_upload_size, read_staged_file_upload
          };
          loadable_module::Header header = {};
          const loadable_module::StoreStatus status =
              loadable_module::validate_app(app_source, header);
          if(status ==
             loadable_module::StoreStatus::INCOMPATIBLE_FIRMWARE) {
            return file_transfer_error("PUT_FIRMWARE");
          }
          if(status != loadable_module::StoreStatus::OK) {
            return file_transfer_error("PUT_APP");
          }
        }
#endif
        if(!program_store::write_file_from_source(
             file_upload_target.parent_id, program_store::INVALID_ID,
             file_upload_target.type, file_upload_target.name,
             file_upload_size, source)) {
          return file_transfer_error("PUT_IO");
        }
        const u16 completed = file_upload_size;
        cancel_file_upload();
        Serial.print("@MKC:DONE ");
        Serial.print(completed);
        Serial.write(' ');
        Serial.println(crc);
        return terminal_protocol::Result::ok();
      }

      return file_transfer_error("PUT_USAGE");
    }

