bolknote/MK61S_MINI/code/terminal.cpp
void class_terminal::DumpRegisters(void) {
     // -0.12345678 -9A (14)
      char buffer[15];

      for(int i=0; i < 15; i++) {
        Serial.write('R');
        Serial.print(i, HEX);
        Serial.print(" = ");
        MK61Emu_ReadRegister(i, buffer, terminal_symbols);
        //Serial.write((char*) &buffer[0], 3); //Serial.write(buffer[1]); Serial.write('.');
        terminal_println_cp1251((char*) &buffer);
      }

      Serial.print("IP: "); Serial.println(core_61::get_IP());
    }

void class_terminal::Dump1302(void) {
      char buff[43];
      MK61Emu_get_1302_R(&buff[0]);
      Serial.println(buff);
    }

void  class_terminal::print_address_as_MK61(usize addr) {
      if(addr > 99) {
        Serial.write('A');
        Serial.print(addr-100);
      } else {
        if(addr < 10) Serial.write('0');
        Serial.print(addr);
      }
    }

void class_terminal::reset_command_state(void) {
      const bool upload_was_active = file_upload_active;
      AT                    = 0;
      recive_pos            = 0;
      input_cursor          = 0;
      pending_confirmation_cmd = CMD_UNKNOWN;
      nSlot                 = -1;
      input_overflow        = false;
      pending_save_name[0]  = 0;
      pending_save_parent_id = program_store::ROOT_ID;
      file_upload_active    = false;
      file_upload_size      = 0;
      file_upload_received  = 0;
      file_upload_checksum  = 0;
      file_upload_checksum_state = 0;
      if(upload_was_active && program_store::ready()) {
        program_store::vfat_stage_forget(FILE_UPLOAD_STAGE_FIRST_KEY,
                                         FILE_UPLOAD_STAGE_BLOCKS);
      }
      if(upload_was_active) program_store::vfat_stage_unlock();
      (void) language_workspace::discard(
          language_workspace::Owner::TERMINAL_TRANSFER);
    }

void class_terminal::reset_line_editor(void) {
      escape_decoder.reset();
      prev_terminator       = 0;
      hist_nav              = -1;
      saved_len             = 0;
      saved_cursor          = 0;
      hist_head             = 0;
      hist_count            = 0;
      hist_used             = 0;
      hist_write            = 0;
    }

void  class_terminal::init(void) {
      current_directory = program_store::ROOT_ID;
      reset_command_state();
      reset_line_editor();
#if MK61_ENABLE_TERMINAL_ENCODING
      terminal_text_encoding = terminal_encoding::Mode::CP1251;
#endif
      Serial.begin(115200);
#if defined(USBCON) && defined(USBD_USE_CDC)
      // Сохраняем паузу для стартового баннера, не пропуская вслепую запрос
      // активации desktop-клиента. Открытие порта CDC поднимает DTR, поэтому при
      // подключённом хосте инициализация сразу продолжается, а уже полученная
      // команда `uscreen` остаётся в буфере для анализатора.
      const t_time_ms host_wait_started = millis();
      while(!Serial &&
            (t_time_ms) (millis() - host_wait_started) < 1800) {}
#else
      delay(1800);
#endif
      output_version();
      print_prompt();
    }

void class_terminal::init_script(void) {
      current_directory = program_store::ROOT_ID;
      reset_command_state();
    }

void  class_terminal::echo_mk61_stack(void) {
      char cvalue[15];
      cvalue[14] = 0;

      Serial.print("X1 = "); terminal_println_cp1251(read_stack_register(stack::X1, cvalue, terminal_symbols));
      Serial.print("T  = "); terminal_println_cp1251(read_stack_register(stack::T, cvalue, terminal_symbols));
      Serial.print("Z  = "); terminal_println_cp1251(read_stack_register(stack::Z, cvalue, terminal_symbols));
      Serial.print("Y  = "); terminal_println_cp1251(read_stack_register(stack::Y, cvalue, terminal_symbols));
      Serial.print("X  = "); terminal_println_cp1251(read_stack_register(stack::X, cvalue, terminal_symbols));
      Serial.print("IP =  "); Serial.println(core_61::get_IP());
    }

void  class_terminal::echo_ISA_61(void) {
      static constexpr isize COLUMN_COUNT = 4;
      static constexpr usize COLUMN_SIZE  = 10;

      TerminalMnemonicTable table(TerminalMnemonicKind::ISA);
      if(!table.ok()) {
        Serial.println("Mnemonic workspace busy");
        return;
      }
      const char* const isa = table.data();

      u8 opcode = 0;
      usize begin = 0;
      isize column = COLUMN_COUNT;
      // Вывод в 4 колонки, в формате opcode - инструкция
      for(usize i = 0;; i++) {
        if(isa[i] == ',' || isa[i] == 0) { // обнаружен разделитель команд или окончание массива
          const isize len = i - begin;
          Serial_write_hex(opcode); Serial.write(' '); Serial.write(&isa[begin], len);
          if(column-- <= 0) { // завершим вывод строки, все 4 колонки выведены
            Serial.println();
            column = COLUMN_COUNT;
          } else { // завершим вывод колонки и дополним ее выводом пробелов
            for(usize space_counter = len; space_counter <= COLUMN_SIZE; space_counter++) Serial.write(' ');
          }
          begin = i + 1;
          opcode++;
          if(isa[i] == 0) break;
        }
      }
    }

void class_terminal::pub_mk61_code_page(void) {
      TerminalMnemonicTable table(TerminalMnemonicKind::CLASSIC);
      if(!table.ok()) {
        Serial.println("Mnemonic workspace busy");
        return;
      }
      char op[MAX_LEN_CLASSIC_MNEMO+1];
      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
      core_61::get_code_page(&code_page[0]);
      isize last_cmd_addr = seek_program_END(&code_page[0]);
      const isize program_steps = (isize) core_61::program_steps();
      isize address = 0;
      for (int i=0; i<30; i++) {
        if(i > last_cmd_addr) break;
        for (int ii=0; ii<4; ii++) {
          address = ii*30 + i;
          if(address > last_cmd_addr) break;
          if (address < program_steps) {
            print_address_as_MK61(address); Serial.print(". ");

            const u8 code = code_page[address];
            if(address > 0 && core_61::len_code_command(code_page[address-1]) == 2) {
              Serial_write_hex(code);
              for(usize cnt_space=2; cnt_space < MAX_LEN_CLASSIC_MNEMO + 2; cnt_space++) Serial.print(' ');
            } else {
              terminal_write_cp1251(terminal_mnemonic_code(
                  table.data(), code, &op[0]));
              for(usize ln=strlen(op); ln < MAX_LEN_CLASSIC_MNEMO; ln++) Serial.write(' ');
              Serial.print("  ");
            }
          }
        }
        Serial.println();
      }
    }

