bolknote/MK61S_MINI/code/terminal.cpp
void  class_terminal::lasm_mk61_code_page(mnemo_type type) {
      TerminalMnemonicTable table(
          type == mnemo_type::ISA_CLASSIC
              ? TerminalMnemonicKind::CLASSIC : TerminalMnemonicKind::ISA);
      if(!table.ok()) {
        Serial.println("Mnemonic workspace busy");
        return;
      }
      char op[MAX_LEN_CLASSIC_MNEMO+1];
      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};

      core_61::get_code_page(&code_page[0]);
      isize lastCommand = seek_program_END(&code_page[0]);
      isize j = 0;
      for (isize i=0; i<30; i++) {
        for (isize ii=0; ii<4; ii++) {
          j = ii*30 + i;
          if (lastCommand > j) {
            Serial.print("00");
            print_address_as_MK61(j);
            const u8 code = code_page[j];
            const u8 code2 = code_page[j+1];
            Serial.write(' '); Serial_write_hex(code); Serial.write(' ');
            if (j > 0){
              if (core_61::len_code_command(code_page[j-1]) == 2) {
                Serial.print("      ");
              } else {
                const char* mnemo = terminal_mnemonic_code(
                    table.data(), code, &op[0]);
                if(type == mnemo_type::ISA_CLASSIC) terminal_write_cp1251(mnemo);
                else Serial.print(mnemo);
                for(usize ln=strlen(op); ln < 6; ln++) Serial.write(' ');
              }
            } else {
              const char* mnemo = terminal_mnemonic_code(
                  table.data(), code, &op[0]);
              if(type == mnemo_type::ISA_CLASSIC) terminal_write_cp1251(mnemo);
              else Serial.print(mnemo);
              for(usize ln=strlen(op); ln < 6; ln++) Serial.write(' ');
            }
            if ( core_61::len_code_command(code) == 2 ) {
              Serial_write_hex(code2);
              Serial.print("  ");
            } else {
              Serial.print("    ");
            }
            Serial.print("  ");
          }
         }
         if (i > lastCommand) { break; }
         Serial.println();
      }
    }

bool class_terminal::GetHexString(const char* args) {
      args = terminal_core::skip_spaces(args);
      if(args == NULL) return false;

      usize address = 0;
      for(usize i = 0; i < 4; i++) {
        if(args[i] < '0' || args[i] > '9') {
          Serial.println("Address must contain exactly four decimal digits.");
          return false;
        }
        address = address * 10 + (usize) (args[i] - '0');
      }
      if(!terminal_core::is_space(args[4]) || address >= core_61::MAX_PROGRAM_STEP) {
        Serial.println("BAD address!");
        return false;
      }

      const char* hex = terminal_core::skip_spaces(args + 4);
      if(hex == NULL || terminal_core::is_end(*hex)) {
        Serial.println("Hex byte string is empty.");
        return false;
      }

      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
      core_61::get_code_page(&code_page[0]);
      usize write_at = address;
      while(!terminal_core::is_end(*hex) && !terminal_core::is_space(*hex)) {
        const int high = terminal_core::digit_value(hex[0], 16);
        const int low = terminal_core::digit_value(hex[1], 16);
        if(high < 0 || low < 0) {
          Serial.println("Hex byte string must contain complete byte pairs.");
          return false;
        }
        if(write_at >= core_61::MAX_PROGRAM_STEP) {
          Serial.println("Program memory overflow!");
          return false;
        }
        code_page[write_at++] = (u8) ((high << 4) | low);
        hex += 2;
      }
      if(!terminal_core::at_end(hex)) {
        Serial.println("Unexpected text after hex byte string.");
        return false;
      }

      const bool force_expanded = write_at > core_61::CLASSIC_PROGRAM_STEP;
      apply_program_memory_auto(&code_page[0], core_61::MAX_PROGRAM_STEP, false, force_expanded);
      core_61::set_code_page(&code_page[0]);
      return true;
    }

void  class_terminal::PutHexString(void) {
      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
      core_61::get_code_page(&code_page[0]);
      isize last_cmd_addr = seek_program_END(&code_page[0]);
      dbgln(MINI, "Last step in programm: ", last_cmd_addr);
      isize j = 0;
      while (j < last_cmd_addr) {
        Serial.print("00"); print_address_as_MK61(j); Serial.write(' ');
        isize jk = 0;
        while (jk < 24) {
          Serial_write_hex(code_page[j]);
          j++; jk++;
          if (j >= last_cmd_addr) break;
        }
        Serial.println();
      }
    }

bool class_terminal::Assembler(void) {
      TerminalMnemonicTable table(TerminalMnemonicKind::ISA);
      if(!table.ok()) {
        Serial.println("Mnemonic workspace busy");
        return false;
      }
      const terminal_core::Assembly assembly = terminal_core::parse_assembly(
        command_args(), AT, table.data(), core_61::MAX_PROGRAM_STEP);
      if(assembly.error != terminal_core::AssemblyError::NONE) {
        ErrorReaction();
        switch(assembly.error) {
          case terminal_core::AssemblyError::EMPTY: Serial.println("Usage: asm [addr] <mnemonics>"); break;
          case terminal_core::AssemblyError::BAD_ADDRESS: Serial.println("BAD address!"); break;
          case terminal_core::AssemblyError::TOO_LONG: Serial.println("Program memory overflow!"); break;
          case terminal_core::AssemblyError::UNKNOWN_MNEMONIC:
            Serial.print("Unexpected token: ");
            Serial.println(assembly.error_at == NULL ? "" : assembly.error_at);
            break;
          case terminal_core::AssemblyError::NONE: break;
        }
        return false;
      }

      // Сначала полностью разбираем, затем применяем один раз: ошибочный токен
      // должен оставить программу без изменений.
      u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
      core_61::get_code_page(&code_page[0]);
      for(usize i = 0; i < assembly.count; i++) code_page[assembly.address + i] = assembly.opcodes[i];
      apply_program_memory_auto(&code_page[0], core_61::MAX_PROGRAM_STEP, false);
      core_61::set_code_page(&code_page[0]);
      AT = (isize) (assembly.address + assembly.count);

