bolknote/MK61S_MINI/code/terminal.cpp
      Serial.print("Assembled ");
      Serial.print(assembly.count);
      Serial.print(" opcode(s) at ");
      Serial.println(assembly.address);
      return true;
    }

terminal_protocol::Result class_terminal::command_to_kbd(bool script_mode) {
      usize code_61 = 0;
      const usize command_count = terminal_keys::COUNT;
      if(!terminal_core::parse_single_unsigned(command_args(), 16, command_count - 1, code_61)) {
        Serial.println("Usage: cmd <00..EF>");
        return terminal_protocol::Result::error();
      }

      u32 sequence = terminal_keys::sequence((u8) code_61);
      dbgln(MK61E, "mk61 <- ", (u8) code_61);
      dbghexln(MK61E, "mk61 <- $", (i32) sequence);

      for(isize i=0; i<4; i++) {
        const i8 scan_code = sequence & 0xFF;
        if(scan_code < 0) break;

        // Скрипт адресует ядро, а не текущий foreground (это может быть меню).
        if(script_mode) hidden_press_key((sw) scan_code);
        else kbd::push(scan_code);
        sequence >>= 8;
      }
      return terminal_protocol::Result::ok();
    }

bool class_terminal::scancode_to_kbd(i32& out) {
      usize key_code = 0;
      if(!terminal_core::parse_single_unsigned(command_args(), 16, 0x27, key_code)) {
        Serial.println("Usage: kbd <00..27>");
        return false;
      }
      dbghexln(MK61E, "mk61 <- ", key_code, "H");
      out = (i32) key_code;
      return true;
    }

bool class_terminal::value_fits_mk61(double value) {
      char sign = ' ';
      char mantissa[8];
      isize pow10 = 0;
      return mk61_ref::double_to_parts(value, sign, mantissa, pow10);
    }

bool class_terminal::write_register_value(u8 reg, const char* args) {
      const mk61_ref::Ref ref = {mk61_ref::Kind::R, reg};
      mk61_register_init::Value value = {};
      if(!mk61_register_init::parse(args, value)) return false;
      // Сначала проверяем сам адрес. В частности, недоступный RF не должен
      // расходовать очередное значение независимого потока M61_INIT.
      if(!mk61_ref::register_available(reg)) return false;

      switch(value.kind) {
        case mk61_register_init::Kind::NUMBER:
          return value_fits_mk61(value.number) &&
                 mk61_ref::write(ref, value.number);
        case mk61_register_init::Kind::RANDOM: {
          // Этот путь намеренно не проверяет random_seed_enabled(): настройка
          // управляет только ROM-командой К СЧ, а инициализатор M61 имеет свой
          // независимый поток аппаратно собранной энтропии.
          const u32 seed7 = entropy_pool::next_decimal7(
              entropy_pool::Domain::M61_INIT);
          return mk61_ref::write_fraction7(ref, seed7);
        }
        case mk61_register_init::Kind::RAW:
          return mk61_ref::write_raw_register(reg, value.raw);
      }
      return false;
    }

bool class_terminal::write_stack_value(const char* args) {
      args = terminal_core::skip_spaces(args);
      if(args == NULL || args[0] == 0 || !terminal_core::is_space(args[1])) return false;

      char name[2] = {args[0], 0};
      mk61_ref::Ref ref;
      if(!mk61_ref::parse_name(name, ref) || ref.kind == mk61_ref::Kind::R) return false;

      double value = 0.0;
      if(!terminal_core::parse_single_decimal(args + 1, value) || !value_fits_mk61(value)) return false;
      return mk61_ref::write(ref, value);
    }

const char* class_terminal::command_args(void) {
      const char* p = (const char*) input_buffer;
      while(!terminal_core::is_end(*p) && !terminal_core::is_space(*p)) p++;
      return terminal_core::skip_spaces(p);
    }

isize class_terminal::parse_u32_list(const char* p, u32* out, usize max_count) {
      usize count = 0;
      while(true) {
        while(*p == ' ' || *p == ',') p++;
        if(*p == 0) break;
        if(*p < '0' || *p > '9') return -1;
        u32 value = 0;
        while(*p >= '0' && *p <= '9') {
          const u32 digit = (u32) (*p++ - '0');
          if(value > (0xFFFFFFFFUL - digit) / 10) return -1;
          value = value * 10 + digit;
        }
        if(count >= max_count) return -1;
        out[count++] = value;
      }
      return (isize) count;
    }

bool class_terminal::exec_led(void) {
      u32 values[2 * led::PATTERN_MAX - 1];
      const isize n = parse_u32_list(command_args(), values, 2 * led::PATTERN_MAX - 1);
      if(n <= 0 || (n % 2) == 0) return false; // нечётный список: state,ms,...,state

      led::PatternStep steps[led::PATTERN_MAX];
      usize count = 0;
      for(isize i = 0; i < n; i += 2) {
        if(values[i] > 1) return false;
        if(i + 1 < n && values[i + 1] > 65535) return false; // пауза хранится в u16
        steps[count].on = (u8) values[i];
        steps[count].hold_ms = (u16) ((i + 1 < n) ? values[i + 1] : 0);
        count++;
      }
      return led::pattern_start(steps, count);
    }

bool class_terminal::exec_beep(void) {
      u32 values[2 * SOUND_PATTERN_MAX];
      const isize n = parse_u32_list(command_args(), values, 2 * SOUND_PATTERN_MAX);
      if(n <= 0 || (n % 2) != 0) return false;

      SoundNote notes[SOUND_PATTERN_MAX];
      const usize count = (usize) n / 2;
      for(usize i = 0; i < count; i++) {
        if(values[2 * i] > 65535 || values[2 * i + 1] > 65535) return false; // u16 в SoundNote
        notes[i].frequency_Hz = (u16) values[2 * i];
        notes[i].duration_ms = (u16) values[2 * i + 1];
        notes[i].gap_ms = 0;
        notes[i].volume_percent = 100;
      }
      return sound_pattern_start(notes, count);
    }

bool class_terminal::parse_mk_display_value(const char* v, double& out) {
      char buffer[20];
      char* w = buffer;
      if(v[0] == '-') *w++ = '-';
      for(int i = 1; i <= 9; i++) {
        const char c = v[i];
        if(c == '.') { *w++ = c; continue; }
        if(c == ' ') continue;
        if(c < '0' || c > '9') return false;
        *w++ = c;
      }
      if(v[12] < '0' || v[12] > '9' || v[13] < '0' || v[13] > '9') return false;
      *w++ = 'e';
      *w++ = (v[11] == '-') ? '-' : '+';
      *w++ = v[12];
      *w++ = v[13];
      *w = 0;
      out = mk_math::atof(buffer);
      return true;
    }

bool class_terminal::operand_delimiter(char c) {
      return terminal_core::is_end(c) || terminal_core::is_space(c) || c == '<' || c == '>' || c == '=' || c == '!';
    }

bool class_terminal::parse_if_operand(const char*& p, double& out) {
      p = terminal_core::skip_spaces(p);
      const char c = (*p >= 'A' && *p <= 'Z') ? (char) (*p - 'A' + 'a') : *p;

