bolknote/MK61S_MINI/code/terminal.cpp
      if(c == 'r') {
        const isize reg = HexdecimalDigit(p[1]);
        if(reg >= 0 && operand_delimiter(p[2])) {
          if(reg == 15 && !core_61::expanded_program_is_on()) return false;
          char value[15];
          value[14] = 0;
          MK61Emu_ReadRegister((int) reg, value, terminal_symbols);
          p += 2;
          return parse_mk_display_value(value, out);
        }
        return false;
      }

      if(c == 'x' || c == 'y' || c == 'z' || c == 't') {
        stack reg = stack::X;
        usize advance = 1;
        if(c == 'x' && p[1] == '1') { reg = stack::X1; advance = 2; }
        else if(c == 'x') reg = stack::X;
        else if(c == 'y') reg = stack::Y;
        else if(c == 'z') reg = stack::Z;
        else reg = stack::T;
        if(!operand_delimiter(p[advance])) return false;

        char value[15];
        value[14] = 0;
        read_stack_register(reg, value, terminal_symbols);
        p += advance;
        return parse_mk_display_value(value, out);
      }

      return terminal_core::parse_decimal(p, out);
    }

bool class_terminal::screen_put_byte(u8 x, u8 y, u8 value, void* user_data) {
      MK61Display& display = *(MK61Display*) user_data;
      display.setCursor(x, y);
      return display.write(value) == 1;
    }

bool class_terminal::screen_clear(void* user_data) {
      ((MK61Display*) user_data)->clear();
      return true;
    }

bool class_terminal::print_byte(u8 value, void* user_data) {
      PrintRenderContext& context = *(PrintRenderContext*) user_data;
      return context.writer->write(value);
    }

bool class_terminal::print_text(const char* text, PrintRenderContext& context) {
      if(text == nullptr) return false;
      while(*text != 0) {
        if(!context.writer->write((u8) *text++)) return false;
      }
      return true;
    }

bool class_terminal::print_number_text(const char text[15],
                                  m61_print::ValueFormat format,
                                  PrintRenderContext& context) {
      const auto ascii_digit = [](u8 value) {
        return value == (u8) display_symbols[0] ? (u8) '0' : value;
      };
      switch(format) {
        case m61_print::ValueFormat::INDICATOR:
          return print_text(text, context);
        case m61_print::ValueFormat::MANTISSA_HEAD:
          return context.writer->write(ascii_digit((u8) text[1]));
        case m61_print::ValueFormat::ABS_EXPONENT: {
          const u8 tens = ascii_digit((u8) text[12]);
          if(tens != '0' && !context.writer->write(tens)) return false;
          return context.writer->write(ascii_digit((u8) text[13]));
        }
      }
      return false;
    }

bool class_terminal::print_value(const m61_print::ValueRef& value, void* user_data) {
      PrintRenderContext& context = *(PrintRenderContext*) user_data;
      char text[15];
      text[14] = 0;
      if(value.kind == m61_print::ValueKind::REGISTER) {
        MK61Emu_ReadRegister((int) value.index, text, display_symbols);
        return print_number_text(text, value.format, context);
      }

      const m61_print::StackValue stack_value =
          (m61_print::StackValue) value.index;
      if(stack_value == m61_print::StackValue::X2) {
        return print_text(MK61Emu_GetIndicatorStr(display_symbols), context);
      }

      stack reg = stack::X;
      switch(stack_value) {
        case m61_print::StackValue::X: reg = stack::X; break;
        case m61_print::StackValue::Y: reg = stack::Y; break;
        case m61_print::StackValue::Z: reg = stack::Z; break;
        case m61_print::StackValue::T: reg = stack::T; break;
        case m61_print::StackValue::X1: reg = stack::X1; break;
        case m61_print::StackValue::X2: break;
      }
      read_stack_register(reg, text, display_symbols);
      return print_number_text(text, value.format, context);
    }

bool class_terminal::exec_print(bool script_mode) {
      MK61Display& display = main_lcd();
      const m61_print::Control control =
          m61_print::parse_control(command_args());
      if(control != m61_print::Control::NONE) {
        if(!script_mode) {
          Serial.println("print off/on work in M61 scripts only");
          return false;
        }
        if(control == m61_print::Control::OFF) {
          MK61DisplayUpdate update(display);
          display.clear();
          display.setCursor(0, 0);
          print_saved_cursor = {};
          m61_text::claim_display();
        } else {
          m61_text::release_display();
        }
        return true;
      }
      const m61_ansi::Sink sink = {
        screen_put_byte, screen_clear, &display
      };
      m61_ansi::Writer writer(
          display.cols(), display.rows(), display.cursorX(), display.cursorY(),
          print_saved_cursor, sink);
      PrintRenderContext context = {&writer};
      MK61DisplayUpdate update(display);
      const m61_print::Result result = m61_print::render(
          command_args(), core_61::expanded_program_is_on(),
          print_byte, print_value, &context);
      display.setCursor(writer.cursorX(), writer.cursorY());
      if(result.ok()) {
        if(script_mode) m61_text::claim_display();
        return true;
      }
      Serial.print("Print error: ");
      Serial.println(m61_print::error_message(result.error));
      return false;
    }

terminal_protocol::Result class_terminal::exec_if(bool script_mode, bool trap_mode) {
      const char* p = command_args();
      double lhs = 0.0;
      double rhs = 0.0;
      bool parsed = parse_if_operand(p, lhs);

      char op0 = 0;
      char op1 = 0;
      if(parsed) {
        p = terminal_core::skip_spaces(p);
        op0 = p[0];
        if(op0 == '>' || op0 == '<' || op0 == '=' || op0 == '!') {
          p++;
          if(*p == '=') { op1 = '='; p++; }
        }
        parsed = (op0 == '>' || op0 == '<') || ((op0 == '=' || op0 == '!') && op1 == '=');
      }
      if(parsed) parsed = parse_if_operand(p, rhs);

      const char* tail = terminal_core::skip_spaces(p);
      if(!parsed || *tail == 0) {
        recive_pos = 0;
        Serial.println("Usage: if <x|y|z|t|x1|r0..re> <op> <value> <command>");
        return terminal_protocol::Result::error();
      }

      bool condition = false;
      if(op0 == '>') condition = op1 ? (lhs >= rhs) : (lhs > rhs);
      if(op0 == '<') condition = op1 ? (lhs <= rhs) : (lhs < rhs);
      if(op0 == '=') condition = (lhs == rhs);
      if(op0 == '!') condition = (lhs != rhs);

      if(!condition) {
        recive_pos = 0;
        return terminal_protocol::Result::ok();
      }

      // Условие истинно: остаток строки выполняется как обычная команда.
      const usize tail_offset = (usize) (tail - (const char*) input_buffer);
      const usize tail_len = strlen(tail);
      memmove(input_buffer, tail, tail_len);
      input_buffer[tail_len] = CR; // контракт execute(): последний символ CR
      recive_pos = tail_len + 1;
      terminal_protocol::Result result = execute(script_mode, trap_mode);
      if(!terminal_core::restore_conditional_argument_offset(
           input_buffer, MAX_INPUT_CHAR, tail_offset, tail_len,
           result.args)) {
        return terminal_protocol::Result::error();
      }
      return result;
    }

